<script setup>
    
</script>
<template>
    <section class="info-products-layer bc-white p-125-0 df fd-c w-100 jc-c">
        <div class="content info-products">
            <h2>
                У нас точные описания
                и цены каждого товара
            </h2>

            <div class="products-items df jc-sb f1">
                <div class="product-item br-5 df fd-c p-40" style="background-color: #F0F0F0;">
                    <span>Другие магазины</span>
                    <ul>
                        <li style="margin: 0px 0px 25px 0px;font-size: 20px;color: #CE2E41;">
                            <svg width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M10 0.00488281C4.47 0.00488281 0 4.47488 0 10.0049C0 15.5349 4.47 20.0049 10 20.0049C15.53 20.0049 20 15.5349 20 10.0049C20 4.47488 15.53 0.00488281 10 0.00488281ZM15 13.5949L13.59 15.0049L10 11.4149L6.41 15.0049L5 13.5949L8.59 10.0049L5 6.41488L6.41 5.00488L10 8.59488L13.59 5.00488L15 6.41488L11.41 10.0049L15 13.5949Z" fill="#CE2E41"/>
                            <path d="M15 13.5949L13.59 15.0049L10 11.4149L6.41 15.0049L5 13.5949L8.59 10.0049L5 6.41488L6.41 5.00488L10 8.59488L13.59 5.00488L15 6.41488L11.41 10.0049L15 13.5949Z" fill="white"/>
                            </svg>

                            Ошибки в описании товаров
                        </li>
                        <li>
                            <svg width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <rect y="0.00488281" width="20" height="20" rx="10" fill="#CE2E41"/>
                            <path d="M11.346 5.55488V15.0049H9.204V7.58488H8.672V5.55488H11.346Z" fill="white"/>
                            </svg>

                            Несоответствие цвета или текстуры
                        </li>
                        <li>
                            <svg width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <rect y="0.00488281" width="20" height="20" rx="10" fill="#CE2E41"/>
                            <path d="M7.018 15.0049V13.3389L10.196 10.1889C10.6253 9.75955 10.9287 9.40488 11.106 9.12488C11.2833 8.83555 11.372 8.55555 11.372 8.28488C11.372 7.96755 11.2787 7.72488 11.092 7.55688C10.9053 7.37955 10.6393 7.29088 10.294 7.29088C9.47267 7.29088 9.062 7.70622 9.062 8.53688H6.92C6.92 7.52888 7.21867 6.74488 7.816 6.18488C8.42267 5.62488 9.26733 5.34488 10.35 5.34488C11.358 5.34488 12.1467 5.59222 12.716 6.08688C13.2853 6.58155 13.57 7.26288 13.57 8.13088C13.57 8.67222 13.4393 9.17622 13.178 9.64288C12.926 10.1095 12.492 10.6322 11.876 11.2109L9.832 13.1569L13.598 13.1289V15.0049H7.018Z" fill="white"/>
                            </svg>

                            Неправильные размеры
                        </li>
                        <li>
                            <svg width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <rect y="0.00488281" width="20" height="20" rx="10" fill="#CE2E41"/>
                            <path d="M10.196 5.34488C11.2413 5.34488 12.044 5.55955 12.604 5.98888C13.1733 6.41822 13.458 7.03422 13.458 7.83688C13.458 8.38755 13.3087 8.84955 13.01 9.22288C12.7207 9.58688 12.31 9.82955 11.778 9.95088V9.97888C12.4127 10.0815 12.898 10.3335 13.234 10.7349C13.5793 11.1269 13.752 11.6495 13.752 12.3029C13.752 13.2175 13.444 13.9315 12.828 14.4449C12.212 14.9582 11.3533 15.2149 10.252 15.2149C9.09467 15.2149 8.208 14.9489 7.592 14.4169C6.976 13.8849 6.668 13.1195 6.668 12.1209H8.88C8.936 12.8862 9.398 13.2689 10.266 13.2689C11.1247 13.2689 11.554 12.8722 11.554 12.0789C11.554 11.6589 11.4093 11.3649 11.12 11.1969C10.84 11.0289 10.3547 10.9449 9.664 10.9449H9.342V9.34888H9.664C10.1867 9.34888 10.5647 9.26022 10.798 9.08288C11.0407 8.90555 11.162 8.62555 11.162 8.24288C11.162 7.60822 10.812 7.29088 10.112 7.29088C9.76667 7.29088 9.496 7.37488 9.3 7.54288C9.104 7.71088 9.00133 7.93955 8.992 8.22888H6.822C6.83133 7.31422 7.12533 6.60488 7.704 6.10088C8.292 5.59688 9.12267 5.34488 10.196 5.34488Z" fill="white"/>
                            </svg>

                            Старые неактуальные цены
                        </li>
                    </ul>
                    <p>
                        Происходит из-за того, что описания берут 
                        из свободных источников. Они не всегда точные
                    </p>
                </div>

                <div class="product-item br-5 df fd-c p-40" style="background-color: #F9EAEC;">
                    <span>Наш магазин ГК полюс</span>
                    <ul>
                        <li style="margin: 0px 0px 25px 0px;font-size: 20px;color: #CE2E41;">
                            <svg width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M10 0.00488281C4.48 0.00488281 0 4.48488 0 10.0049C0 15.5249 4.48 20.0049 10 20.0049C15.52 20.0049 20 15.5249 20 10.0049C20 4.48488 15.52 0.00488281 10 0.00488281ZM8 15.0049L3 10.0049L4.41 8.59488L8 12.1749L15.59 4.58488L17 6.00488L8 15.0049Z" fill="#CE2E41"/>
                            <path d="M8 15.0049L3 10.0049L4.41 8.59488L8 12.1749L15.59 4.58488L17 6.00488L8 15.0049Z" fill="white"/>
                            </svg>

                            Реальное описание
                        </li>
                        <li>
                            <svg width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <rect y="0.00488281" width="20" height="20" rx="10" fill="#CE2E41"/>
                            <path d="M11.346 5.55488V15.0049H9.204V7.58488H8.672V5.55488H11.346Z" fill="white"/>
                            </svg>

                            Данные товаров заполняются с документов присылаемых производителем
                        </li>
                        <li>
                            <svg width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <rect y="0.00488281" width="20" height="20" rx="10" fill="#CE2E41"/>
                            <path d="M7.018 15.0049V13.3389L10.196 10.1889C10.6253 9.75955 10.9287 9.40488 11.106 9.12488C11.2833 8.83555 11.372 8.55555 11.372 8.28488C11.372 7.96755 11.2787 7.72488 11.092 7.55688C10.9053 7.37955 10.6393 7.29088 10.294 7.29088C9.47267 7.29088 9.062 7.70622 9.062 8.53688H6.92C6.92 7.52888 7.21867 6.74488 7.816 6.18488C8.42267 5.62488 9.26733 5.34488 10.35 5.34488C11.358 5.34488 12.1467 5.59222 12.716 6.08688C13.2853 6.58155 13.57 7.26288 13.57 8.13088C13.57 8.67222 13.4393 9.17622 13.178 9.64288C12.926 10.1095 12.492 10.6322 11.876 11.2109L9.832 13.1569L13.598 13.1289V15.0049H7.018Z" fill="white"/>
                            </svg>

                            Цены обновляются автоматически через 1С базу
                        </li>
                    </ul>
                </div>
                <img src="~/assets/img/info_product_item_img.svg" alt="">
            </div>
        </div>
    </section>
</template>
<style scoped>
    h2{
        font-size: 40px;
        font-weight: 700;
        max-width: 600px;
        margin: 0px 0px 30px 0px;
    }

    .product-item{
        width: 32%;

        && li{
            display: flex;
            font-size: 18px;
            align-items: flex-start;
            margin: 15px 0px 0px 0px;
        }

        && svg{
            margin: 0px 10px 0px 0px;
            min-width: 20px;
            min-height: 20px;
        }

        && ul{
            line-height: 1.2;
        }

        && p{
            font-size: 14px;
            margin: 15px 0px 0px 0px;
        }

        && span{
            font-size: 30px;
            font-weight: 700;
            margin: 0px 0px 15px 0px;
        }
    }

    .products-items{

        && img{
            object-fit: cover;
        }
    }
</style>