<template>
  <div class="reviews_form_layer">
    <span>
      Для тех, кто не разбирается в технической части 
      помогаем подобрать строительные материалы
    </span>

    <div class="reviews_form_info_layer">
      <div class="reviews_form_steps">
        <div class="reviews_step">
          <svg width="58" height="58" viewBox="0 0 58 58" fill="none" xmlns="http://www.w3.org/2000/svg">
<rect y="0.00488281" width="58" height="58" rx="5" fill="#CE2E41"/>
<g clip-path="url(#clip0_101_2534)">
<path d="M40.3333 20.5L35.375 21.9167V25.7275C35.3744 27.3291 35.844 28.8956 36.7254 30.2328C37.6068 31.57 38.8613 32.6191 40.3333 33.25C41.8054 32.6191 43.0599 31.57 43.9413 30.2328C44.8227 28.8956 45.2922 27.3291 45.2917 25.7275V21.9167L40.3333 20.5ZM42.9542 25.2529C39.0938 29.1062 40.0004 28.9646 37.6983 26.6696C37.565 26.5362 37.49 26.3553 37.49 26.1667C37.49 25.978 37.565 25.7971 37.6983 25.6638C37.8317 25.5304 38.0126 25.4554 38.2013 25.4554C38.3899 25.4554 38.5708 25.5304 38.7042 25.6638L39.625 26.5846L41.9554 24.2471C42.0888 24.1137 42.2697 24.0388 42.4583 24.0388C42.647 24.0388 42.8279 24.1137 42.9613 24.2471C43.0946 24.3805 43.1696 24.5614 43.1696 24.75C43.1696 24.9386 43.0946 25.1195 42.9613 25.2529H42.9542Z" fill="white"/>
<path d="M33.9596 25.7275V20.8471L40.3346 19.0266V14.8333C40.3346 14.2697 40.1108 13.7292 39.7122 13.3307C39.3137 12.9322 38.7732 12.7083 38.2096 12.7083H17.668C18.4194 12.7083 19.1401 13.0068 19.6714 13.5382C20.2028 14.0695 20.5013 14.7902 20.5013 15.5416V22.625H28.293C29.0444 22.625 29.7651 22.9235 30.2964 23.4548C30.8278 23.9862 31.1263 24.7069 31.1263 25.4583V36.3879L32.9042 35.375L35.3763 36.7916L37.8555 35.375L40.3346 36.7916V34.7941C35.8438 32.8604 33.9596 29.3471 33.9596 25.7275ZM33.2513 18.375H23.3346C23.1468 18.375 22.9666 18.3004 22.8338 18.1675C22.7009 18.0347 22.6263 17.8545 22.6263 17.6666C22.6263 17.4788 22.7009 17.2986 22.8338 17.1658C22.9666 17.0329 23.1468 16.9583 23.3346 16.9583H33.2513C33.4392 16.9583 33.6193 17.0329 33.7522 17.1658C33.885 17.2986 33.9596 17.4788 33.9596 17.6666C33.9596 17.8545 33.885 18.0347 33.7522 18.1675C33.6193 18.3004 33.4392 18.375 33.2513 18.375Z" fill="white"/>
<path d="M16.25 27.5833H26.1667V30.4166H16.25V27.5833Z" fill="white"/>
<path d="M28.2923 24.0416H14.1257C13.7499 24.0416 13.3896 24.1909 13.1239 24.4566C12.8582 24.7222 12.709 25.0826 12.709 25.4583V43.875C12.709 44.2507 12.8582 44.611 13.1239 44.8767C13.3896 45.1424 13.7499 45.2916 14.1257 45.2916H28.2923C28.668 45.2916 29.0284 45.1424 29.2941 44.8767C29.5597 44.611 29.709 44.2507 29.709 43.875V25.4583C29.709 25.0826 29.5597 24.7222 29.2941 24.4566C29.0284 24.1909 28.668 24.0416 28.2923 24.0416ZM16.959 42.4583H15.5423C15.3545 42.4583 15.1743 42.3837 15.0415 42.2508C14.9086 42.118 14.834 41.9378 14.834 41.75C14.834 41.5621 14.9086 41.3819 15.0415 41.2491C15.1743 41.1163 15.3545 41.0416 15.5423 41.0416H16.959C17.1468 41.0416 17.327 41.1163 17.4599 41.2491C17.5927 41.3819 17.6673 41.5621 17.6673 41.75C17.6673 41.9378 17.5927 42.118 17.4599 42.2508C17.327 42.3837 17.1468 42.4583 16.959 42.4583ZM16.959 38.9166H15.5423C15.3545 38.9166 15.1743 38.842 15.0415 38.7092C14.9086 38.5763 14.834 38.3962 14.834 38.2083C14.834 38.0204 14.9086 37.8403 15.0415 37.7074C15.1743 37.5746 15.3545 37.5 15.5423 37.5H16.959C17.1468 37.5 17.327 37.5746 17.4599 37.7074C17.5927 37.8403 17.6673 38.0204 17.6673 38.2083C17.6673 38.3962 17.5927 38.5763 17.4599 38.7092C17.327 38.842 17.1468 38.9166 16.959 38.9166ZM16.959 35.375H15.5423C15.3545 35.375 15.1743 35.3003 15.0415 35.1675C14.9086 35.0347 14.834 34.8545 14.834 34.6666C14.834 34.4788 14.9086 34.2986 15.0415 34.1658C15.1743 34.0329 15.3545 33.9583 15.5423 33.9583H16.959C17.1468 33.9583 17.327 34.0329 17.4599 34.1658C17.5927 34.2986 17.6673 34.4788 17.6673 34.6666C17.6673 34.8545 17.5927 35.0347 17.4599 35.1675C17.327 35.3003 17.1468 35.375 16.959 35.375ZM21.9173 42.4583H20.5007C20.3128 42.4583 20.1326 42.3837 19.9998 42.2508C19.8669 42.118 19.7923 41.9378 19.7923 41.75C19.7923 41.5621 19.8669 41.3819 19.9998 41.2491C20.1326 41.1163 20.3128 41.0416 20.5007 41.0416H21.9173C22.1052 41.0416 22.2853 41.1163 22.4182 41.2491C22.551 41.3819 22.6257 41.5621 22.6257 41.75C22.6257 41.9378 22.551 42.118 22.4182 42.2508C22.2853 42.3837 22.1052 42.4583 21.9173 42.4583ZM21.9173 38.9166H20.5007C20.3128 38.9166 20.1326 38.842 19.9998 38.7092C19.8669 38.5763 19.7923 38.3962 19.7923 38.2083C19.7923 38.0204 19.8669 37.8403 19.9998 37.7074C20.1326 37.5746 20.3128 37.5 20.5007 37.5H21.9173C22.1052 37.5 22.2853 37.5746 22.4182 37.7074C22.551 37.8403 22.6257 38.0204 22.6257 38.2083C22.6257 38.3962 22.551 38.5763 22.4182 38.7092C22.2853 38.842 22.1052 38.9166 21.9173 38.9166ZM21.9173 35.375H20.5007C20.3128 35.375 20.1326 35.3003 19.9998 35.1675C19.8669 35.0347 19.7923 34.8545 19.7923 34.6666C19.7923 34.4788 19.8669 34.2986 19.9998 34.1658C20.1326 34.0329 20.3128 33.9583 20.5007 33.9583H21.9173C22.1052 33.9583 22.2853 34.0329 22.4182 34.1658C22.551 34.2986 22.6257 34.4788 22.6257 34.6666C22.6257 34.8545 22.551 35.0347 22.4182 35.1675C22.2853 35.3003 22.1052 35.375 21.9173 35.375ZM26.8757 42.4583H25.459C25.2711 42.4583 25.091 42.3837 24.9581 42.2508C24.8253 42.118 24.7507 41.9378 24.7507 41.75C24.7507 41.5621 24.8253 41.3819 24.9581 41.2491C25.091 41.1163 25.2711 41.0416 25.459 41.0416H26.8757C27.0635 41.0416 27.2437 41.1163 27.3765 41.2491C27.5094 41.3819 27.584 41.5621 27.584 41.75C27.584 41.9378 27.5094 42.118 27.3765 42.2508C27.2437 42.3837 27.0635 42.4583 26.8757 42.4583ZM26.8757 38.9166H25.459C25.2711 38.9166 25.091 38.842 24.9581 38.7092C24.8253 38.5763 24.7507 38.3962 24.7507 38.2083C24.7507 38.0204 24.8253 37.8403 24.9581 37.7074C25.091 37.5746 25.2711 37.5 25.459 37.5H26.8757C27.0635 37.5 27.2437 37.5746 27.3765 37.7074C27.5094 37.8403 27.584 38.0204 27.584 38.2083C27.584 38.3962 27.5094 38.5763 27.3765 38.7092C27.2437 38.842 27.0635 38.9166 26.8757 38.9166ZM26.8757 35.375H25.459C25.2711 35.375 25.091 35.3003 24.9581 35.1675C24.8253 35.0347 24.7507 34.8545 24.7507 34.6666C24.7507 34.4788 24.8253 34.2986 24.9581 34.1658C25.091 34.0329 25.2711 33.9583 25.459 33.9583H26.8757C27.0635 33.9583 27.2437 34.0329 27.3765 34.1658C27.5094 34.2986 27.584 34.4788 27.584 34.6666C27.584 34.8545 27.5094 35.0347 27.3765 35.1675C27.2437 35.3003 27.0635 35.375 26.8757 35.375ZM27.584 31.125C27.584 31.3128 27.5094 31.493 27.3765 31.6258C27.2437 31.7587 27.0635 31.8333 26.8757 31.8333H15.5423C15.3545 31.8333 15.1743 31.7587 15.0415 31.6258C14.9086 31.493 14.834 31.3128 14.834 31.125V26.875C14.834 26.6871 14.9086 26.5069 15.0415 26.3741C15.1743 26.2413 15.3545 26.1666 15.5423 26.1666H26.8757C27.0635 26.1666 27.2437 26.2413 27.3765 26.3741C27.5094 26.5069 27.584 26.6871 27.584 26.875V31.125Z" fill="white"/>
<path d="M19.0833 15.5417C19.0833 15.1659 18.9341 14.8056 18.6684 14.5399C18.4027 14.2743 18.0424 14.125 17.6667 14.125C17.2909 14.125 16.9306 14.2743 16.6649 14.5399C16.3993 14.8056 16.25 15.1659 16.25 15.5417V18.375H19.0833V15.5417Z" fill="white"/>
</g>
<defs>
<clipPath id="clip0_101_2534">
<rect width="34" height="34" fill="white" transform="translate(12 12)"/>
</clipPath>
</defs>
          </svg>

          <div class="step_title">
            <span>        
              Рассчитаем необходимое 
              количество стройматериалов
            </span>
            <p>
              Просто называете, что вам нужно сделать
            </p>
          </div>
        </div>
        <div class="reviews_step">
          <svg width="58" height="58" viewBox="0 0 58 58" fill="none" xmlns="http://www.w3.org/2000/svg">
<rect y="0.00488281" width="58" height="58" rx="5" fill="#CE2E41"/>
<g clip-path="url(#clip0_101_2547)">
<path d="M22.3333 22.6667C23.622 22.6667 24.6667 21.622 24.6667 20.3333C24.6667 19.0447 23.622 18 22.3333 18C21.0447 18 20 19.0447 20 20.3333C20 21.622 21.0447 22.6667 22.3333 22.6667Z" fill="white"/>
<path d="M33 19H40V18.5858L33.4142 12H33V19Z" fill="white"/>
<path d="M33 43H32V39.7287C32 37.6727 33.6727 36 35.7287 36H36.1429L36.1439 35.9958C35.9282 33.7699 35.4627 31.5725 34.755 29.4495C34.5667 28.8847 34.4713 28.2963 34.4713 27.7008V27.5299C34.4713 24.4811 36.9513 22.0007 40 22.0001V21.0001H31V12H14V46H33V43ZM22.3333 16C24.7227 16 26.6667 17.9439 26.6667 20.3333C26.6667 22.7227 24.7227 24.6667 22.3333 24.6667C19.9439 24.6667 18 22.7227 18 20.3333C18 17.9439 19.9439 16 22.3333 16ZM18 27H32V29H18V27ZM18 31H32V33H18V31ZM27.3333 41H18V39H27.3333V41ZM29 37H18V35H29V37Z" fill="white"/>
<path d="M36.4707 27.5299V27.7007C36.4707 28.0809 36.5316 28.4565 36.6518 28.817C37.4279 31.1452 37.9311 33.5572 38.1524 35.9999H41.8488C42.0701 33.5572 42.5733 31.1452 43.3494 28.817C43.4696 28.4563 43.5306 28.0808 43.5306 27.7007V27.5299C43.5306 25.5835 41.947 24 40.0006 24C38.0542 24 36.4707 25.5835 36.4707 27.5299Z" fill="white"/>
<path d="M34 39.7287V41H46V39.7287C46 38.7755 45.2245 38 44.2713 38H35.7287C34.7755 38 34 38.7755 34 39.7287Z" fill="white"/>
<path d="M35 43H45V46H35V43Z" fill="white"/>
</g>
<defs>
<clipPath id="clip0_101_2547">
<rect width="34" height="34" fill="white" transform="translate(13 12)"/>
</clipPath>
</defs>
          </svg>


          <div class="step_title">
            <span>        
              Подготовим решение под ключ
            </span>
            <p>
              и предоставим полный пакет документов
            </p>
          </div>
        </div>
        <div class="reviews_step">
          <svg width="58" height="58" viewBox="0 0 58 58" fill="none" xmlns="http://www.w3.org/2000/svg">
<rect y="0.00488281" width="58" height="58" rx="5" fill="#CE2E41"/>
<g clip-path="url(#clip0_101_2561)">
<path d="M43.7457 37.8681L29.4883 45.8701C29.1855 46.0401 28.8163 46.0401 28.5135 45.8701L14.2561 37.8681C13.578 37.4883 13.5794 36.5101 14.2561 36.1309L17.8021 34.1407L27.5386 39.6053C28.4467 40.1155 29.5565 40.1147 30.4632 39.6053L40.1996 34.1407L43.7457 36.1309C44.4237 36.5108 44.4224 37.4889 43.7457 37.8681Z" fill="white"/>
<path d="M43.7457 28.129L40.1996 26.1388L30.4632 31.6033C29.5567 32.1127 28.4464 32.1133 27.5386 31.6033L17.8021 26.1388L14.2561 28.129C13.5794 28.5081 13.578 29.4863 14.2561 29.8661L28.5135 37.8681C28.8163 38.0381 29.1855 38.0381 29.4883 37.8681L43.7457 29.8661C44.4224 29.487 44.4237 28.5088 43.7457 28.129ZM20.1954 31.177C19.6449 31.177 19.1993 30.7308 19.1993 30.1809C19.1993 29.6304 19.6449 29.1848 20.1954 29.1848C20.7453 29.1848 21.1915 29.6304 21.1915 30.1809C21.1915 30.7308 20.7453 31.177 20.1954 31.177ZM24.4368 33.644C23.8863 33.644 23.4407 33.1977 23.4407 32.6479C23.4407 32.0974 23.8863 31.6518 24.4368 31.6518C24.9866 31.6518 25.4329 32.0974 25.4329 32.6479C25.4329 33.1977 24.9866 33.644 24.4368 33.644ZM29.0009 35.9549C28.4511 35.9549 28.0048 35.5093 28.0048 34.9588C28.0048 34.409 28.4511 33.9627 29.0009 33.9627C29.5507 33.9627 29.997 34.409 29.997 34.9588C29.997 35.5093 29.5507 35.9549 29.0009 35.9549ZM33.565 33.644C33.0152 33.644 32.5689 33.1977 32.5689 32.6479C32.5689 32.0974 33.0152 31.6518 33.565 31.6518C34.1155 31.6518 34.5611 32.0974 34.5611 32.6479C34.5611 33.1977 34.1155 33.644 33.565 33.644ZM37.8064 31.177C37.2565 31.177 36.8103 30.7308 36.8103 30.1809C36.8103 29.6304 37.2565 29.1848 37.8064 29.1848C38.3569 29.1848 38.8025 29.6304 38.8025 30.1809C38.8025 30.7308 38.3569 31.177 37.8064 31.177Z" fill="white"/>
<path d="M43.7457 21.8642L29.4883 29.8662C29.1854 30.0362 28.8163 30.0362 28.5135 29.8662L14.2561 21.8642C13.578 21.4844 13.5794 20.5062 14.2561 20.127L28.5135 12.1251C28.8164 11.9551 29.1855 11.9551 29.4883 12.1251L43.7457 20.127C44.4237 20.5069 44.4224 21.485 43.7457 21.8642Z" fill="white"/>
</g>
<defs>
<clipPath id="clip0_101_2561">
<rect width="34" height="34" fill="white" transform="translate(12 11.9976)"/>
</clipPath>
</defs>
          </svg>


          <div class="step_title">
            <span>        
              Учтем совместимость
            </span>
            <p>
              материалов между собой в вашем объекте
            </p>
          </div>
        </div>
        <div class="reviews_step">
          <svg width="58" height="58" viewBox="0 0 58 58" fill="none" xmlns="http://www.w3.org/2000/svg">
<rect y="0.00488281" width="58" height="58" rx="5" fill="#CE2E41"/>
<g clip-path="url(#clip0_101_2573)">
<path d="M45.7082 33.0301L41.0403 28.3621C40.8535 28.1752 40.6002 28.0703 40.3359 28.0703H33.7344C33.4701 28.0703 33.2168 28.1752 33.0301 28.3621L28.3621 33.0301C28.1753 33.2168 28.0703 33.4702 28.0703 33.7344V40.3359C28.0703 40.6002 28.1753 40.8535 28.3621 41.0403L33.0301 45.7082C33.2168 45.895 33.4702 46 33.7344 46H40.3359C40.6002 46 40.8535 45.8951 41.0403 45.7082L45.7082 41.0403C45.895 40.8535 46 40.6001 46 40.3359V33.7344C46 33.4701 45.8951 33.2168 45.7082 33.0301ZM41.0195 38.6856L38.6856 41.0195H35.3848L33.0508 38.6856V35.3848L35.3848 33.0508H38.6856L41.0195 35.3848V38.6856Z" fill="white"/>
<path d="M26.2773 12H12.9961C12.446 12 12 12.446 12 12.9961V15.7852C12 16.1182 12.1664 16.4292 12.4436 16.6139L15.9844 18.9744V21.7693L15.3531 21.9496C14.8242 22.1008 14.5179 22.6521 14.669 23.1811C14.8201 23.7101 15.3714 24.0163 15.9004 23.8652L15.9844 23.8412V25.674L23.2891 23.587V21.7542L23.9203 21.5739C24.4492 21.4227 24.7556 20.8714 24.6044 20.3424C24.4533 19.8134 23.902 19.5072 23.373 19.6583L23.2891 19.6822V18.9744L26.8298 16.6139C27.107 16.4292 27.2734 16.1182 27.2734 15.7852V12.9961C27.2734 12.446 26.8275 12 26.2773 12Z" fill="white"/>
<path d="M24.6049 38.2721C24.4537 37.7431 23.9024 37.4368 23.3734 37.5879L15.3536 39.8793C14.8246 40.0305 14.5183 40.5818 14.6694 41.1108C14.8206 41.6398 15.3719 41.946 15.9009 41.7949L15.9886 41.7698C16.0055 41.9651 16.0798 42.1518 16.2031 42.3058L18.8593 45.6261C19.0484 45.8625 19.3345 46 19.6372 46C19.9398 46 20.2259 45.8625 20.415 45.6261L23.0712 42.3058C23.2125 42.1293 23.2895 41.9098 23.2895 41.6836V39.6838L23.9208 39.5035C24.4497 39.3523 24.756 38.801 24.6049 38.2721Z" fill="white"/>
<path d="M24.6049 32.2955C24.4537 31.7665 23.9024 31.4602 23.3734 31.6114L15.3536 33.9028C14.8246 34.0539 14.5183 34.6052 14.6694 35.1342C14.8206 35.6632 15.3719 35.9695 15.9009 35.8183L15.9848 35.7944V37.6271L23.2895 35.5401V33.7074L23.9208 33.527C24.4497 33.3758 24.756 32.8245 24.6049 32.2955Z" fill="white"/>
<path d="M24.6049 26.3189C24.4537 25.7899 23.9024 25.4837 23.3734 25.6348L15.3536 27.9262C14.8246 28.0774 14.5183 28.6287 14.6694 29.1577C14.8206 29.6867 15.3719 29.9929 15.9009 29.8418L15.9848 29.8178V31.6506L23.2895 29.5635V27.7308L23.9208 27.5504C24.4497 27.3992 24.756 26.8479 24.6049 26.3189Z" fill="white"/>
</g>
<defs>
<clipPath id="clip0_101_2573">
<rect width="34" height="34" fill="white" transform="translate(12 12)"/>
</clipPath>
</defs>
          </svg>


          <div class="step_title">
            <span>        
              Cформируем предложение 
              с необходимыми комплектующими
            </span>
            <p>
              Системы крепления, аксессуары, доборные элементы и прочее
            </p>
          </div>
        </div>
      </div>

      <div class="reviews_form">

        <span class="reviews_form_title">
          Работают менеджеры со знанием и опытом в стройсфере
        </span>
        <p>
          Не просто "говорящие головы"
        </p>
        
        <div class="reviews_form_title_desc">
          <svg width="18" height="18" viewBox="0 0 18 18" fill="none" xmlns="http://www.w3.org/2000/svg">
          <path d="M9 0.00488281C4.032 0.00488281 0 4.03688 0 9.00488C0 13.9729 4.032 18.0049 9 18.0049C13.968 18.0049 18 13.9729 18 9.00488C18 4.03688 13.968 0.00488281 9 0.00488281ZM7.2 13.5049L2.7 9.00488L3.969 7.73588L7.2 10.9579L14.031 4.12688L15.3 5.40488L7.2 13.5049Z" fill="#CE2E41"/>
          </svg>

          У нас более 500 наименований, не ошибитесь с выбором, 
          чтобы не пришлось тратить время на возвраты. 
          Свяжитесь и получите подбор со сметой
        </div>
        <form action="" class="reviews_form">
          <input type="text" placeholder="Ваш телефон *">
          <button type="submit">
            Подобрать товары
            <svg width="12" height="12" viewBox="0 0 12 12" fill="none" xmlns="http://www.w3.org/2000/svg">
              <g clip-path="url(#clip0_101_2602)">
              <path d="M3 10.5949L7.58 6.00488L3 1.41488L4.41 0.00488281L10.41 6.00488L4.41 12.0049L3 10.5949Z" fill="white"/>
              </g>
              <defs>
              <clipPath id="clip0_101_2602">
              <rect width="12" height="12" fill="white" transform="translate(0 0.00488281)"/>
              </clipPath>
              </defs>
            </svg>
          </button>
        </form>
        
        <div class="form_contants">
          <span style="font-size: 20px;font-weight: 500;width: max-content;min-width: max-content;display: flex;align-items: center;margin: 0px 35px 0px 0px;">
            <svg width="19" height="18" viewBox="0 0 19 18" fill="none" xmlns="http://www.w3.org/2000/svg" style="margin: 0px 15px 0px 0px;">
              <path d="M4.12 7.79488C5.56 10.6249 7.88 12.9349 10.71 14.3849L12.91 12.1849C13.18 11.9149 13.58 11.8249 13.93 11.9449C15.05 12.3149 16.26 12.5149 17.5 12.5149C18.05 12.5149 18.5 12.9649 18.5 13.5149V17.0049C18.5 17.5549 18.05 18.0049 17.5 18.0049C8.11 18.0049 0.5 10.3949 0.5 1.00488C0.5 0.454883 0.95 0.00488281 1.5 0.00488281H5C5.55 0.00488281 6 0.454883 6 1.00488C6 2.25488 6.2 3.45488 6.57 4.57488C6.68 4.92488 6.6 5.31488 6.32 5.59488L4.12 7.79488Z" fill="#CE2E41"/>
            </svg>

            8 800 567 56 67
          </span>

            <NuxtLink to="">
              <svg width="31" height="30" viewBox="0 0 31 30" fill="none" xmlns="http://www.w3.org/2000/svg">
              <rect x="0.5" y="0.00488281" width="30" height="30" rx="5" fill="#2AABEE"/>
              <path fill-rule="evenodd" clip-rule="evenodd" d="M7.28977 14.8466C11.6626 12.9414 14.5785 11.6854 16.0374 11.0786C20.2031 9.34592 21.0687 9.04494 21.6329 9.035C21.757 9.03282 22.0344 9.06357 22.2141 9.2094C22.3659 9.33253 22.4076 9.49887 22.4276 9.61562C22.4476 9.73236 22.4725 9.99831 22.4527 10.2061C22.2269 12.578 21.2502 18.3338 20.7533 20.9904C20.543 22.1144 20.129 22.4913 19.7281 22.5282C18.8571 22.6084 18.1956 21.9525 17.3519 21.3995C16.0317 20.5341 15.2859 19.9954 14.0044 19.1509C12.5235 18.175 13.4835 17.6386 14.3275 16.762C14.5484 16.5325 18.3864 13.0416 18.4607 12.7249C18.4699 12.6853 18.4786 12.5377 18.3909 12.4597C18.3032 12.3818 18.1737 12.4084 18.0803 12.4296C17.9479 12.4597 15.8389 13.8537 11.7532 16.6116C11.1546 17.0227 10.6123 17.2229 10.1265 17.2124C9.59094 17.2009 8.5607 16.9096 7.79483 16.6607C6.85545 16.3553 6.10886 16.1939 6.17387 15.6753C6.20773 15.4052 6.5797 15.1289 7.28977 14.8466Z" fill="white"/>
            </svg>
            </NuxtLink>

            <NuxtLink to="">
              <svg width="31" height="30" viewBox="0 0 31 30" fill="none" xmlns="http://www.w3.org/2000/svg">
              <rect x="0.5" y="0.00488281" width="30" height="30" rx="5" fill="#2CD44A"/>
              <path d="M15.756 7.12354H15.7522C11.5468 7.12354 8.12695 10.5443 8.12695 14.7507C8.12695 16.4191 8.66467 17.9655 9.57897 19.2211L8.62844 22.0546L11.5601 21.1174C12.7661 21.9163 14.2048 22.3778 15.756 22.3778C19.9614 22.3778 23.3812 18.9561 23.3812 14.7507C23.3812 10.5453 19.9614 7.12354 15.756 7.12354ZM20.194 17.894C20.01 18.4136 19.2797 18.8445 18.6972 18.9704C18.2987 19.0552 17.7781 19.1229 16.0258 18.3964C13.7844 17.4678 12.3409 15.1902 12.2284 15.0424C12.1207 14.8946 11.3227 13.8364 11.3227 12.7419C11.3227 11.6474 11.8785 11.1144 12.1026 10.8856C12.2866 10.6978 12.5907 10.612 12.8825 10.612C12.9768 10.612 13.0617 10.6168 13.138 10.6206C13.362 10.6301 13.4745 10.6435 13.6223 10.9972C13.8063 11.4405 14.2544 12.535 14.3078 12.6475C14.3621 12.76 14.4165 12.9125 14.3402 13.0603C14.2687 13.2128 14.2058 13.2805 14.0933 13.4102C13.9808 13.5398 13.874 13.639 13.7615 13.7782C13.6585 13.8993 13.5422 14.0289 13.6719 14.253C13.8015 14.4723 14.2496 15.2035 14.9094 15.7908C15.7607 16.5487 16.451 16.7909 16.6979 16.8939C16.8819 16.9701 17.1012 16.952 17.2356 16.809C17.4063 16.625 17.617 16.3199 17.8315 16.0196C17.9841 15.8042 18.1766 15.7775 18.3788 15.8537C18.5847 15.9252 19.6744 16.4639 19.8985 16.5754C20.1225 16.6879 20.2703 16.7413 20.3246 16.8357C20.378 16.9301 20.378 17.3734 20.194 17.894Z" fill="white"/>
              </svg>
            </NuxtLink>

        </div>
      </div>
    </div>
    

    <div class="form_shield">
      <span>
        Даем тройную гарантию всем без исключения
        <img src="~/assets/img/shield.svg" alt="">
      </span>

      <div class="shield_steps_layer">
        <div class="shield_step">
          <svg width="20" height="28" viewBox="0 0 20 28" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path d="M10 4.00488C4.48 4.00488 0 8.48488 0 14.0049C0 19.5249 4.48 24.0049 10 24.0049C15.52 24.0049 20 19.5249 20 14.0049C20 8.48488 15.52 4.00488 10 4.00488ZM8 19.0049L3 14.0049L4.41 12.5949L8 16.1749L15.59 8.58488L17 10.0049L8 19.0049Z" fill="#CE2E41"/>
            <path d="M8 19.0049L3 14.0049L4.41 12.5949L8 16.1749L15.59 8.58488L17 10.0049L8 19.0049Z" fill="white"/>
          </svg>
          <div class="shield_step_info">
            <span>Гарантия сроков</span>
            <p>
              благодаря наличию 1000+ ходовых товаров 
              на 2х складах и транспорта для доставки
            </p>
          </div>
        </div>


        <div class="shield_step">
          <svg width="20" height="28" viewBox="0 0 20 28" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path d="M10 4.00488C4.48 4.00488 0 8.48488 0 14.0049C0 19.5249 4.48 24.0049 10 24.0049C15.52 24.0049 20 19.5249 20 14.0049C20 8.48488 15.52 4.00488 10 4.00488ZM8 19.0049L3 14.0049L4.41 12.5949L8 16.1749L15.59 8.58488L17 10.0049L8 19.0049Z" fill="#CE2E41"/>
            <path d="M8 19.0049L3 14.0049L4.41 12.5949L8 16.1749L15.59 8.58488L17 10.0049L8 19.0049Z" fill="white"/>
          </svg>
          <div class="shield_step_info">
            <span>Гарантия качества</span>
            <p>
              Продаем товары с официальной гарантией 
              от проверенных брендов с сертификатами качества
            </p>
          </div>
        </div>


        <div class="shield_step">
          <svg width="20" height="28" viewBox="0 0 20 28" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path d="M10 4.00488C4.48 4.00488 0 8.48488 0 14.0049C0 19.5249 4.48 24.0049 10 24.0049C15.52 24.0049 20 19.5249 20 14.0049C20 8.48488 15.52 4.00488 10 4.00488ZM8 19.0049L3 14.0049L4.41 12.5949L8 16.1749L15.59 8.58488L17 10.0049L8 19.0049Z" fill="#CE2E41"/>
            <path d="M8 19.0049L3 14.0049L4.41 12.5949L8 16.1749L15.59 8.58488L17 10.0049L8 19.0049Z" fill="white"/>
          </svg>
          <div class="shield_step_info">
            <span>Гарантия фиксированной 
              цены и без скрытых доплат</span>
            <p>
              Заключаем договор с подробной сметой
              с ценой каждой позиции
            </p>
          </div>
        </div>
      </div>
    </div>








  <div class="selection_analogue_layer">
    <div class="selection_analogue_two">
      <div class="analogue">
        <svg width="50" height="50" viewBox="0 0 50 50" fill="none" xmlns="http://www.w3.org/2000/svg" style="position: absolute;left: -25px;top: 30px;">
        <rect y="0.00488281" width="50" height="50" rx="5" fill="#CE2E41"/>
        <g clip-path="url(#clip0_101_2644)">
        <path fill-rule="evenodd" clip-rule="evenodd" d="M11.6846 22.8389C11.2748 22.8389 10.9505 22.4883 11.0071 22.0825C11.807 16.3441 16.3488 11.8039 22.0879 11.0064C22.4937 10.95 22.8441 11.2742 22.8441 11.6839V12.619C22.8441 13.2013 23.3162 13.6734 23.8986 13.6734C24.4808 13.6734 24.9529 13.2013 24.9529 12.619V11.6847C24.9529 11.2749 25.3035 10.9506 25.7093 11.0072C32.0382 11.8897 36.9095 17.3238 36.9095 23.8956C36.9095 23.9592 36.9091 24.0226 36.9081 24.086C36.9008 24.5969 36.3414 24.8878 35.8701 24.6901C34.8544 24.264 33.7389 24.0285 32.5685 24.0285C27.8519 24.0285 24.0285 27.8519 24.0285 32.5685C24.0285 33.7389 24.264 34.8544 24.6901 35.8701C24.8878 36.3414 24.597 36.9008 24.086 36.9081C24.0227 36.9091 23.9592 36.9095 23.8956 36.9095C17.3219 36.9095 11.8865 32.0354 11.0064 25.704C10.95 25.2982 11.2743 24.9477 11.684 24.9477H12.6241C13.2065 24.9477 13.6786 24.4757 13.6786 23.8934C13.6786 23.311 13.2065 22.8389 12.6241 22.8389H11.6846ZM24.9508 18.6598C24.9508 18.0775 24.4787 17.6054 23.8965 17.6054C23.3141 17.6054 22.842 18.0775 22.842 18.6598V23.4912C22.842 23.6849 22.7619 23.87 22.6206 24.0027L19.9496 26.5121C19.5252 26.9108 19.5044 27.5781 19.9031 28.0025C20.3018 28.4269 20.9691 28.4477 21.3935 28.049L24.3967 25.2277C24.7503 24.8955 24.9508 24.432 24.9508 23.9469V18.6598Z" fill="white"/>
        <path fill-rule="evenodd" clip-rule="evenodd" d="M32.5679 38.9999C36.1197 38.9999 38.9991 36.1207 38.9991 32.5687C38.9991 29.0169 36.1197 26.1377 32.5679 26.1377C29.0161 26.1377 26.1367 29.0169 26.1367 32.5687C26.1367 36.1207 29.0161 38.9999 32.5679 38.9999ZM35.9862 31.6883C36.3567 31.239 36.2928 30.5744 35.8435 30.2039C35.3942 29.8334 34.7297 29.8973 34.3592 30.3465L32.7136 32.3421C32.4583 32.6519 31.9954 32.6847 31.6989 32.414L31.1417 31.9054C30.7116 31.5129 30.0447 31.5434 29.6521 31.9735C29.2596 32.4035 29.2901 33.0705 29.7202 33.4631L31.1627 34.7796C31.8367 35.3948 32.9585 35.3598 33.5679 34.6209L35.9862 31.6883Z" fill="white"/>
        </g>
        <defs>
        <clipPath id="clip0_101_2644">
        <rect width="28" height="28" fill="white" transform="translate(11 11.0049)"/>
        </clipPath>
        </defs>
        </svg>

        <span>
          Экономите количество часов
        </span>
        <desc style="color: #CE2E41;font-size: 20px;font-weight: 700;">
          В режиме одного окна
        </desc>
        <p>
          Закрываете все вопросы по строительным материалам
        </p>
      </div>


      <div class="analogue">
        <svg width="50" height="50" viewBox="0 0 50 50" fill="none" xmlns="http://www.w3.org/2000/svg" style="position: absolute;left: -25px;top: 30px;">
        <rect y="0.00488281" width="50" height="50" rx="5" fill="#CE2E41"/>
        <g clip-path="url(#clip0_101_2662)">
        <path d="M29.3358 28.373C29.7555 26.4144 31.5741 25.0155 33.6725 25.0155H37.5895V20.8187C37.5895 19.9794 37.0299 19.4198 36.1906 19.4198H12.4087C11.5693 19.4198 11.0098 19.9794 11.0098 20.8187V37.606C11.0098 38.4453 11.5693 39.0049 12.4087 39.0049H36.1906C37.03 39.0049 37.5895 38.4453 37.5895 37.606V33.4091H33.3927C30.8746 33.4091 28.7762 31.0309 29.3358 28.373Z" fill="white"/>
        <path d="M33.3931 27.8134C32.5537 27.8134 31.9941 28.3729 31.9941 29.2123C31.9941 30.0516 32.5537 30.6112 33.3931 30.6112H38.9888V27.8133H33.3931V27.8134Z" fill="white"/>
        <path d="M33.3918 12.4251C33.3918 11.4459 32.5524 10.8863 31.5732 11.0262L13.8066 16.6219H33.3918V12.4251Z" fill="white"/>
        </g>
        <defs>
        <clipPath id="clip0_101_2662">
        <rect width="28" height="28" fill="white" transform="translate(11 11.0049)"/>
        </clipPath>
        </defs>
        </svg>

        <span>
          Экономите количество часов
        </span>
        <desc style="color: #CE2E41;font-size: 20px;font-weight: 700;">
          В режиме одного окна
        </desc>
        <p>
          Закрываете все вопросы по строительным материалам
        </p>
      </div>
    </div>
    <div class="selection_analogue">
      <img src="~/assets/img/selection_analogue.png" alt="" style="position: absolute;right: 0;top: 0;">
      <span>
        Подберем аналог любого строительного товара
      </span>
      <disc style="color: #CE2E41;font-size: 25px;font-weight: 700;z-index: 2;">
        Предоставим цену ниже до 2 раз импортного при том же качестве 

      </disc>
        <index style="z-index: 4;">
        или предложим отечественный аналог с лучшими показателями
        </index>
        <button>
          Подобрать аналог 
          <svg width="8" height="12" viewBox="0 0 8 12" fill="none" xmlns="http://www.w3.org/2000/svg">
          <path d="M0 10.5949L4.58 6.00488L0 1.41488L1.41 0.00488281L7.41 6.00488L1.41 12.0049L0 10.5949Z" fill="white"/>
          </svg>
        </button>
     

    </div>
  </div>





  </div>
  
</template>

<script lang="ts" setup>

</script>

<style setup>
.selection_analogue{
  display: flex;
  flex-direction: column;
  padding: 60px 60px 60px 60px;
  background-color: #FFFFFF;
  border-radius: 5px;
  margin: 40px 0px 0px 0px;
  position: relative;
  overflow: hidden;

  && span{
    font-weight: 700;
    font-size: 40px;
    margin: 0px 0px 20px 0px;
    z-index: 2;
  }

  && button{
    background-color: #CE2E41;
    max-width: max-content;
    height: 50px;
    display: flex;
    color: #FFFFFF;
    font-size: 15px;
    align-items: center;
    width: 100%;
    max-width: 260px;
    justify-content: center;
    border-radius: 5px;
    margin: 40px 0px 0px 0px;
  }

  && svg{
    margin: 0px 0px 0px 10px;
  }
}
.selection_analogue_two{
  display: flex;
  justify-content: space-between;
  margin: 0px 0px 0px 0px;
  padding: 0px 0px 0px 25px;
  gap: 5%;
}
.selection_analogue_two:first-child{
  margin: 0px 0px 0px 0px;
}
.analogue{
  padding: 40px 40px 40px 45px;
  background-color: #FFFFFF;
  /* width: 45%; */
  max-width: 48.00%;
  border-radius: 5px;
  flex: 1;
  margin: 0px 0px 0px 0px;
  position: relative;

  && span{
    font-weight: 700;
    font-size: 30px!IMPORTANT;
    margin: 0px 0px 40px 0px;
  }

  && p{
    font-size: 16px;
    margin: 10px 0px 0px 0px;
  }
}
.selection_analogue_layer{
  margin: 125px 0px 125px 0px;
}
.shield_steps_layer{
  margin: 30px 0px 0px 0px;
  display: flex;
  justify-content: space-between;
}
.shield_step_info{
  display: flex;
  flex-direction: column;
  

  && span{
    font-size: 24px!IMPORTANT;
    font-weight: 500;
    margin: 0px 0px 5px 0px;
  }

  && p{
    font-size: 16px;
    color: #FFFFFF;
  }
}
.shield_step{
  width: 100%;
  display: flex;
  max-width: 379px;

  && svg{
    margin: 0px 10px 0px 0px;
  }
}

.form_shield{
  background-color: #272727;
  padding: 60px 60px 60px 60px;
  border-radius: 5px;
  margin: 125px 0px 0px 0px;

  && span{
    font-size: 40px;
    color: #FFFFFF;
    max-width: 750px!IMPORTANT;
  }

}

.form_contants{
  display: flex;
  width: max-content;
  margin: 0 auto;
}
.reviews_form{
  width: 100%;
  max-width: 550px;
  display: flex;
  flex-direction: column;
  border-radius: 5px;
  background-color: #FFFFFF;
  padding: 40px 40px 40px 40px;

  && .reviews_form_title{
  font-size: 30px;
  }

  && p{
    font-size: 18px;
    margin: 15px 0px 0px 0px;
  }

  && .reviews_form_title_desc{
    font-size: 16px;
    color: #272727;    
    display: flex;
    margin: 20px 0px 0px 0px;
  }

  && svg{
    min-width: 18px;
    min-height: 18px;
    margin: 0px 10px 0px 0px;
  }
  
}
.reviews_form{
  
  && form{
    display: flex;
    flex-direction: column;
    padding: 0px 0px 0px 0px;
    margin: 20px 0px 0px 0px;

    input{
      border: 1px solid #959595!IMPORTANT;
      border-radius: 5px;
      padding: 10px 10px 10px 10px;
      margin: 0px 0px 10px 0px;
    }
    
    button{
      background-color: #CE2E41;
      border-radius: 5px;
      color: #FFFFFF;
      display: flex;
      height: 50px;
      justify-content: center;
      align-items: center;
      font-size: 15px;
      margin: 0px 0px 25px 0px;

      svg{
        min-width: 8px;
        min-height: 8px;
        margin: 0px 0px 0px 10px;
      }
    }
  }
}


.step_title{
  text-align: left;
  display: flex;
  width: 100%;
  flex-direction: column;
}
.reviews_form_steps{
  max-width: 648px;
}
.reviews_step{
  display: flex;
  justify-content: space-between;
  margin: 25px 0px 0px 0px;

  && svg{
    margin: 0px 20px 0px 0px;
  }

  && span{
    font-weight: 700;
    font-size: 25px!IMPORTANT;
    margin: 0px 0px 5px 0px;
  }

  && p{
    font-size: 16px;
  }
}
.reviews_form_info_layer{
  display: flex;
  justify-content: space-between;
  align-items: center;
  width: 100%;
  margin: 30px 0px 0px 0px;
  gap: 20px;
}

.reviews_form_layer{
  margin: 0px 0px 0px 0px;
  
  && span{
    font-weight: 700;
    font-size: 40px;
    max-width: 1000px;
    width: 100%;
    display: flex;
  }
}

@media (max-width: 979px){
  .reviews_form_layer.reviews_form_layer span{
    font-size: 25px;
  }

.step_title{
  && span{
    font-size: 18px!IMPORTANT;
  }

  && p{
    font-size: 14px;
  }
}

.reviews_form.reviews_form .reviews_form_title{
  font-size: 20px;
}

.reviews_form.reviews_form p{
  font-size: 16px;
}

.reviews_form.reviews_form .reviews_form_title_desc{
  font-size: 14px;
}

.form_shield{
  margin: 50px 0px 0px 0px;
  padding: 30px 30px 30px 30px;
}
.shield_steps_layer{
  margin: 0px 0px 0px 0px;
}
.shield_step_info{
  && span{
    font-size: 18px!IMPORTANT;
    font-weight: 500;
  }

  && p{
    font-size: 14px;
  }
}
.shield_step{

  && svg{
    min-width: 15px;
    min-height: 15px;
  }
}

  .selection_analogue_layer{
    margin: 50px 0px 50px 0px;
  }

  .analogue{
    && span{
      font-size: 20px!IMPORTANT;
      margin: 0px 0px 15px 0px!IMPORTANT;
    }

    && desc{
      font-size: 18px!IMPORTANT;
    }
    
    && p{
      font-size: 14px;
    }
  }

  .selection_analogue{
    && disc{
      font-size: 20px!IMPORTANT;
    }
    && img{
      right: -25%!IMPORTANT;
    }
  }
  .selection_analogue.selection_analogue button{
    z-index: 9;
  }

  .selection_analogue{
    padding: 30px 30px 30px 30px;
  }
}

@media (max-width: 679px){
  .reviews_form_info_layer{
    flex-direction: column;
  }
  .reviews_form{
    max-width: 100%;
    margin: 12px 0px 0px 0px;
  }
  .shield_steps_layer{
    flex-direction: column;
    gap: 20px;
  }

  .selection_analogue_two:first-child{
    flex-direction: column;
    gap: 12px;
  }
  .analogue{
    width: 100%;
    max-width: 100%;
  }
  .selection_analogue{
    padding: 20px 20px 20px 20px;
  }
  .selection_analogue.selection_analogue img{
    width: 100%;
    height: 100%;
    object-fit: cover;
    right: -25%;
  }
}
</style>