<template>
  <div>
    <BreadCrabms style="margin: 0px 0px 20px 0px;"></BreadCrabms>
    <PageTitle :title="'Оплата'" :p="'Любые способы оплаты + рассрочка для частных лиц'"></PageTitle>
    <section class="content pay_section">
      <Tabs value="0">
    <TabList>
        <Tab value="0">Частные лица</Tab>
        <Tab value="1">Юридические лица</Tab>
    </TabList>
    <TabPanels>
        <TabPanel value="0">
            <p class="m-0">
              <div class="pay_physics_layer">
                <div class="physic">
                  <div class="physic_card">
                    <svg width="50" height="50" viewBox="0 0 50 50" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M42.7343 8.26562H14.4218C12.1874 8.26562 10.3437 10.0782 10.2969 12.3125H35.5781C39.5781 12.3125 42.828 15.5781 42.828 19.5781V34.5625C45.0625 34.5156 46.875 32.6719 46.875 30.4219V12.4063C46.875 10.125 45.0156 8.26562 42.7343 8.26562Z" fill="#CE2E41"/>
                    <path d="M35.5782 15.4375H7.26566C4.98438 15.4375 3.125 17.2969 3.125 19.5781V22.5156H39.7031V19.5781C39.7031 17.2969 37.8437 15.4375 35.5782 15.4375Z" fill="#CE2E41"/>
                    <path d="M3.125 37.5938C3.125 39.875 4.98438 41.7344 7.26566 41.7344H35.5782C37.8437 41.7344 39.7031 39.875 39.7031 37.5938V25.6406H3.125V37.5938ZM27.9843 32.3594H32.6718C33.5313 32.3594 34.2343 33.0469 34.2343 33.9219C34.2343 34.7813 33.5313 35.4844 32.6718 35.4844H27.9843C27.125 35.4844 26.4218 34.7813 26.4218 33.9219C26.4218 33.0469 27.125 32.3594 27.9843 32.3594Z" fill="#CE2E41"/>
                    </svg>
                    Банковской картой Visa, Mastercard, Мир
                  </div>
                  <div class="physic_card">
                    <svg width="50" height="50" viewBox="0 0 50 50" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M31 5.49512V19.4951H45V5.49512H31ZM41 15.4951H35V9.49515H41V15.4951Z" fill="#CE2E41"/>
                    <path d="M13 23.4951H5V27.4951H13V23.4951Z" fill="#CE2E41"/>
                    <path d="M23 23.4951H17V27.4951H23V23.4951Z" fill="#CE2E41"/>
                    <path d="M27 19.4951H23V23.4951H27V19.4951Z" fill="#CE2E41"/>
                    <path d="M19 13.4951V5.49512H5V19.4951H19H23V13.4951H19ZM15 15.4951H9.00003V9.49515H15V15.4951Z" fill="#CE2E41"/>
                    <path d="M27 5.49512H23V13.4951H27V5.49512Z" fill="#CE2E41"/>
                    <path d="M33 27.4951H36.9999V33.4951H41V23.4951H27V27.4951H29V31.4951H33V27.4951Z" fill="#CE2E41"/>
                    <path d="M29 31.4951H25V37.4951H29V31.4951Z" fill="#CE2E41"/>
                    <path d="M45 33.4951H41V37.4951H45V33.4951Z" fill="#CE2E41"/>
                    <path d="M33.0001 37.4951H29V41.4951H25V45.4952H33.0001V41.4951H37V45.4952H43V41.4951H41V37.4951H37H33.0001Z" fill="#CE2E41"/>
                    <path d="M19 37.4951V31.4951H5V45.4951H19V41.4951H25V37.4951H19ZM15 41.4951H9.00003V35.4951H15V41.4951Z" fill="#CE2E41"/>
                    </svg>
                    СБП по номеру или QR код
                  </div>
                  <div class="physic_card">
                    <svg width="50" height="50" viewBox="0 0 50 50" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M2.61342 25.0528C2.12968 25.2309 1.88034 25.7671 2.05655 26.2527L2.64533 27.8727L7.12831 23.3896L2.61342 25.0528Z" fill="#CE2E41"/>
                    <path d="M6.85547 39.4531L9.55544 46.878C9.63981 47.1124 9.81603 47.3037 10.041 47.4068C10.1666 47.4649 10.3016 47.4949 10.4366 47.4949C10.5473 47.4949 10.656 47.4762 10.761 47.4368L13.7404 46.3381L6.85547 39.4531Z" fill="#CE2E41"/>
                    <path d="M46.9454 33.1151L43.8554 24.6196L36.4399 32.0351L40.1148 30.6814C40.5967 30.4976 41.1404 30.7489 41.3186 31.2364C41.4986 31.722 41.2492 32.262 40.7636 32.4401L36.0949 34.1614C35.988 34.2007 35.8793 34.2195 35.7705 34.2195C35.3898 34.2195 35.0298 33.9851 34.8911 33.6063C34.8893 33.6007 34.8911 33.5951 34.8893 33.5895L27.0312 41.4475L46.3885 34.3151C46.8741 34.137 47.1234 33.6007 46.9454 33.1151Z" fill="#CE2E41"/>
                    <path d="M46.7244 17.7692L31.7245 2.76933C31.3589 2.40371 30.7645 2.40371 30.3989 2.76933L2.27422 30.894C1.90859 31.2596 1.90859 31.854 2.27422 32.2196L17.2741 47.2195C17.4559 47.4033 17.6959 47.4951 17.936 47.4951C18.176 47.4951 18.4159 47.4033 18.5997 47.2213L46.7244 19.0967C47.09 18.7292 47.09 18.1367 46.7244 17.7692ZM12.9748 28.4716L9.22479 32.2215C9.04101 32.4033 8.80107 32.4953 8.56105 32.4953C8.32102 32.4953 8.08108 32.4034 7.8973 32.2215C7.53168 31.8559 7.53168 31.2615 7.8973 30.8958L11.6473 27.1459C12.0129 26.7802 12.6073 26.7802 12.9729 27.1459C13.3385 27.5116 13.3404 28.104 12.9748 28.4716ZM29.1652 29.6621C28.5014 30.3259 27.5996 30.6447 26.5964 30.6447C24.9389 30.6447 23.0021 29.7766 21.3821 28.1547C20.1971 26.9696 19.3646 25.5522 19.0403 24.1647C18.6803 22.6179 18.9766 21.2717 19.8746 20.3717C20.7728 19.4717 22.119 19.1754 23.6677 19.5373C25.0552 19.8617 26.4727 20.6923 27.6576 21.8792C30.262 24.4816 30.9258 27.9015 29.1652 29.6621ZM41.0994 19.0967L37.3495 22.8467C37.1657 23.0285 36.9257 23.1204 36.6857 23.1204C36.4457 23.1204 36.2057 23.0286 36.022 22.8467C35.6564 22.481 35.6564 21.8866 36.022 21.521L39.772 17.771C40.1376 17.4054 40.732 17.4054 41.0976 17.771C41.4632 18.1367 41.4651 18.7292 41.0994 19.0967Z" fill="#CE2E41"/>
                    </svg>
                    Наличными по факту поставки (даем скидку 2%)
                  </div>
                </div>
                <div class="physic">
                  <div class="fuck">
                    <svg class="fuck_svg" width="40" height="40" viewBox="0 0 40 40" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <rect width="40" height="40" rx="5" fill="#CE2E41"/>
                    <path d="M30.0757 14.1776C30.047 13.5462 30.047 12.9435 30.047 12.3408C30.047 11.8529 29.6739 11.4798 29.186 11.4798C25.5986 11.4798 22.8721 10.4466 20.6048 8.23677C20.2604 7.92108 19.7438 7.92108 19.3995 8.23677C17.1322 10.4466 14.4057 11.4798 10.8183 11.4798C10.3304 11.4798 9.9573 11.8529 9.9573 12.3408C9.9573 12.9435 9.9573 13.5462 9.9286 14.1776C9.8138 20.2045 9.64161 28.47 19.7151 31.9426L20.0021 32L20.2891 31.9426C30.334 28.47 30.1905 20.2332 30.0757 14.1776ZM19.3134 22.5291C19.1412 22.6726 18.9403 22.7587 18.7107 22.7587H18.682C18.4524 22.7587 18.2228 22.6439 18.0793 22.4717L15.4102 19.5157L16.7017 18.3677L18.7968 20.6924L23.4461 16.2726L24.6228 17.5354L19.3134 22.5291Z" fill="white"/>
                    </svg>
                    <span>Цены фиксируются</span>
                    <p>в договоре поставки
                      и не подлежат изменению</p>
                  </div>
                </div>
                <div class="phusic_info">
                  <div>
                    <span>Вы можете оформить заказ</span>
                    <p>На сайте или или связавшись по контактам</p>
                  </div>
                  <div>
                    <div class="physic_number">
                      <svg width="19" height="18" viewBox="0 0 19 18" fill="none" xmlns="http://www.w3.org/2000/svg">
                      <path d="M4.12 7.79C5.56 10.62 7.88 12.93 10.71 14.38L12.91 12.18C13.18 11.91 13.58 11.82 13.93 11.94C15.05 12.31 16.26 12.51 17.5 12.51C18.05 12.51 18.5 12.96 18.5 13.51V17C18.5 17.55 18.05 18 17.5 18C8.11 18 0.5 10.39 0.5 1C0.5 0.45 0.95 0 1.5 0H5C5.55 0 6 0.45 6 1C6 2.25 6.2 3.45 6.57 4.57C6.68 4.92 6.6 5.31 6.32 5.59L4.12 7.79Z" fill="#CE2E41"/>
                      </svg>
                      8 800 567 56 67
                    </div>
                    <NuxtLink to="">
                      <svg width="31" height="30" viewBox="0 0 31 30" fill="none" xmlns="http://www.w3.org/2000/svg">
                      <rect x="0.5" width="30" height="30" rx="5" fill="#2AABEE"/>
                      <path fill-rule="evenodd" clip-rule="evenodd" d="M7.28782 14.8414C11.6606 12.9363 14.5765 11.6803 16.0355 11.0734C20.2011 9.34081 21.0667 9.03983 21.6309 9.02989C21.755 9.02771 22.0324 9.05846 22.2122 9.20429C22.3639 9.32742 22.4057 9.49376 22.4256 9.6105C22.4456 9.72725 22.4705 9.9932 22.4507 10.201C22.225 12.5729 21.2482 18.3287 20.7513 20.9852C20.541 22.1093 20.127 22.4862 19.7262 22.5231C18.8551 22.6033 18.1937 21.9474 17.35 21.3944C16.0298 20.529 15.2839 19.9903 14.0025 19.1458C12.5215 18.1698 13.4816 17.6335 14.3256 16.7568C14.5464 16.5274 18.3844 13.0365 18.4587 12.7198C18.468 12.6802 18.4766 12.5326 18.3889 12.4546C18.3012 12.3766 18.1718 12.4033 18.0783 12.4245C17.9459 12.4546 15.8369 13.8485 11.7513 16.6065C11.1526 17.0175 10.6104 17.2178 10.1246 17.2073C9.58899 17.1958 8.55875 16.9045 7.79288 16.6556C6.8535 16.3502 6.1069 16.1888 6.17192 15.6702C6.20578 15.4001 6.57775 15.1238 7.28782 14.8414Z" fill="white"/>
                      </svg>

                    </NuxtLink>
                    <NuxtLink to="">
                      <svg width="31" height="30" viewBox="0 0 31 30" fill="none" xmlns="http://www.w3.org/2000/svg">
                      <rect x="0.5" width="30" height="30" rx="5" fill="#2CD44A"/>
                      <path d="M15.7579 7.11865H15.7541C11.5487 7.11865 8.12891 10.5394 8.12891 14.7458C8.12891 16.4142 8.66662 17.9606 9.58092 19.2162L8.63039 22.0497L11.5621 21.1125C12.7681 21.9115 14.2068 22.3729 15.7579 22.3729C19.9633 22.3729 23.3831 18.9512 23.3831 14.7458C23.3831 10.5404 19.9633 7.11865 15.7579 7.11865ZM20.196 17.8891C20.012 18.4087 19.2817 18.8396 18.6991 18.9655C18.3006 19.0503 17.7801 19.118 16.0277 18.3915C13.7863 17.4629 12.3429 15.1853 12.2304 15.0375C12.1227 14.8897 11.3247 13.8315 11.3247 12.737C11.3247 11.6425 11.8805 11.1095 12.1045 10.8807C12.2885 10.6929 12.5927 10.6071 12.8844 10.6071C12.9788 10.6071 13.0637 10.6119 13.1399 10.6157C13.364 10.6252 13.4765 10.6386 13.6242 10.9923C13.8082 11.4356 14.2563 12.5301 14.3097 12.6426C14.3641 12.7551 14.4184 12.9076 14.3421 13.0554C14.2706 13.208 14.2077 13.2756 14.0952 13.4053C13.9827 13.535 13.8759 13.6341 13.7634 13.7733C13.6605 13.8944 13.5442 14.0241 13.6738 14.2481C13.8035 14.4674 14.2516 15.1986 14.9113 15.7859C15.7627 16.5439 16.453 16.786 16.6999 16.889C16.8839 16.9653 17.1032 16.9471 17.2376 16.8041C17.4082 16.6201 17.6189 16.3151 17.8335 16.0147C17.986 15.7993 18.1786 15.7726 18.3807 15.8488C18.5866 15.9203 19.6764 16.459 19.9004 16.5706C20.1245 16.6831 20.2722 16.7365 20.3266 16.8308C20.38 16.9252 20.38 17.3685 20.196 17.8891Z" fill="white"/>
                      </svg>

                    </NuxtLink>
                  </div>
                </div>
              </div>
            </p>
        </TabPanel>
        <TabPanel value="1">
            <p class="m-0">
              <div class="pay_ul_layer">
                <div class="ul ul-ul">
                  <div class="ul_card">
                    <svg width="50" height="50" viewBox="0 0 50 50" fill="none" xmlns="http://www.w3.org/2000/svg">
                      <path fill-rule="evenodd" clip-rule="evenodd" d="M7.8125 3.125C5.24218 3.125 3.125 5.24217 3.125 7.8125V42.1875C3.125 44.7578 5.24218 46.875 7.8125 46.875H32.8125C34.8607 46.875 36.616 45.5297 37.2467 43.6829C36.8165 43.728 36.3794 43.75 35.9375 43.75C29.0525 43.75 23.4375 38.135 23.4375 31.25C23.4375 24.365 29.0525 18.75 35.9375 18.75C36.4661 18.75 36.9876 18.7866 37.5 18.8508V7.8125C37.5 5.24217 35.3828 3.125 32.8125 3.125H7.8125ZM12.5 9.375H28.125C28.9879 9.375 29.6875 10.0746 29.6875 10.9375C29.6875 11.8004 28.9879 12.5 28.125 12.5H12.5C11.6371 12.5 10.9375 11.8004 10.9375 10.9375C10.9375 10.0746 11.6371 9.375 12.5 9.375ZM12.5 14.0625H28.125C28.9879 14.0625 29.6875 14.7621 29.6875 15.625C29.6875 16.4879 28.9879 17.1875 28.125 17.1875H12.5C11.6371 17.1875 10.9375 16.4879 10.9375 15.625C10.9375 14.7621 11.6371 14.0625 12.5 14.0625ZM12.5 18.75H21.875C22.7379 18.75 23.4375 19.4496 23.4375 20.3125C23.4375 21.1754 22.7379 21.875 21.875 21.875H12.5C11.6371 21.875 10.9375 21.1754 10.9375 20.3125C10.9375 19.4496 11.6371 18.75 12.5 18.75Z" fill="#CE2E41"/>
                      <path fill-rule="evenodd" clip-rule="evenodd" d="M35.9375 21.875C30.7783 21.875 26.5625 26.0908 26.5625 31.25C26.5625 36.4092 30.7783 40.625 35.9375 40.625C41.0967 40.625 45.3125 36.4092 45.3125 31.25C45.3125 30.8356 45.1479 30.4382 44.8549 30.1452C44.5618 29.8521 44.1644 29.6875 43.75 29.6875C43.3356 29.6875 42.9382 29.8521 42.6451 30.1452C42.3521 30.4382 42.1875 30.8356 42.1875 31.25C42.1875 34.7203 39.4078 37.5 35.9375 37.5C32.4672 37.5 29.6875 34.7203 29.6875 31.25C29.6875 27.7797 32.4672 25 35.9375 25C36.8334 25 37.677 25.1862 38.443 25.5219C38.8222 25.6878 39.2518 25.6965 39.6375 25.546C40.0231 25.3955 40.3333 25.0982 40.4999 24.7192C40.5825 24.5313 40.6273 24.3289 40.6317 24.1236C40.6361 23.9184 40.6 23.7143 40.5255 23.5229C40.451 23.3316 40.3394 23.1569 40.1973 23.0087C40.0552 22.8605 39.8853 22.7418 39.6973 22.6593C38.5455 22.1546 37.2694 21.875 35.9375 21.875Z" fill="#CE2E41"/>
                      <path fill-rule="evenodd" clip-rule="evenodd" d="M45.3123 21.875C44.8979 21.8751 44.5005 22.0397 44.2075 22.3328L35.9373 30.603L33.917 28.5828C33.624 28.2898 33.2266 28.1252 32.8123 28.1252C32.3979 28.1252 32.0005 28.2898 31.7075 28.5828C31.4146 28.8758 31.25 29.2732 31.25 29.6875C31.25 30.1018 31.4146 30.4992 31.7075 30.7922L34.8325 33.9172C35.1256 34.2102 35.5229 34.3747 35.9373 34.3747C36.3516 34.3747 36.749 34.2102 37.042 33.9172L46.417 24.5422C46.71 24.2492 46.8745 23.8518 46.8745 23.4375C46.8745 23.0232 46.71 22.6258 46.417 22.3328C46.124 22.0397 45.7266 21.8751 45.3123 21.875Z" fill="#CE2E41"/>
                      <path d="M15.2187 35.2418H14.1719V36.0729H16.8906V36.5618H14.1719V39.4951H11.5937V36.5618H10V36.0729H11.5937V35.2418H10V32.8788H11.5937V28.4951H15.2187C16.4792 28.4951 17.4219 28.7939 18.0469 29.3914C18.6823 29.9889 19 30.8146 19 31.8685C19 32.9223 18.6823 33.748 18.0469 34.3455C17.4219 34.943 16.4792 35.2418 15.2187 35.2418ZM14.1719 30.8581V32.8788H15.0781C15.474 32.8788 15.7708 32.8028 15.9688 32.6507C16.1667 32.4986 16.2656 32.2378 16.2656 31.8685C16.2656 31.4991 16.1667 31.2383 15.9688 31.0862C15.7708 30.9341 15.474 30.8581 15.0781 30.8581H14.1719Z" fill="white"/>
                    </svg>
                    Безналом на расчетный счет компании
                  </div>
                  <div class="ul_card">
                    <svg width="50" height="50" viewBox="0 0 50 50" fill="none" xmlns="http://www.w3.org/2000/svg">
                      <path d="M42.7343 8.26562H14.4218C12.1874 8.26562 10.3437 10.0782 10.2969 12.3125H35.5781C39.5781 12.3125 42.828 15.5781 42.828 19.5781V34.5625C45.0625 34.5156 46.875 32.6719 46.875 30.4219V12.4063C46.875 10.125 45.0156 8.26562 42.7343 8.26562Z" fill="#CE2E41"/>
                      <path d="M35.5782 15.4375H7.26566C4.98438 15.4375 3.125 17.2969 3.125 19.5781V22.5156H39.7031V19.5781C39.7031 17.2969 37.8437 15.4375 35.5782 15.4375Z" fill="#CE2E41"/>
                      <path d="M3.125 37.5938C3.125 39.875 4.98438 41.7344 7.26566 41.7344H35.5782C37.8437 41.7344 39.7031 39.875 39.7031 37.5938V25.6406H3.125V37.5938ZM27.9843 32.3594H32.6718C33.5313 32.3594 34.2343 33.0469 34.2343 33.9219C34.2343 34.7813 33.5313 35.4844 32.6718 35.4844H27.9843C27.125 35.4844 26.4218 34.7813 26.4218 33.9219C26.4218 33.0469 27.125 32.3594 27.9843 32.3594Z" fill="#CE2E41"/>
                    </svg>
                    Банковской картой Visa, Mastercard, Мир
                  </div>
                  <div class="ul_card">
                    <svg width="50" height="50" viewBox="0 0 50 50" fill="none" xmlns="http://www.w3.org/2000/svg">
                      <path d="M31 5.49512V19.4951H45V5.49512H31ZM41 15.4951H35V9.49515H41V15.4951Z" fill="#CE2E41"/>
                      <path d="M13 23.4951H5V27.4951H13V23.4951Z" fill="#CE2E41"/>
                      <path d="M23 23.4951H17V27.4951H23V23.4951Z" fill="#CE2E41"/>
                      <path d="M27 19.4951H23V23.4951H27V19.4951Z" fill="#CE2E41"/>
                      <path d="M19 13.4951V5.49512H5V19.4951H19H23V13.4951H19ZM15 15.4951H9.00003V9.49515H15V15.4951Z" fill="#CE2E41"/>
                      <path d="M27 5.49512H23V13.4951H27V5.49512Z" fill="#CE2E41"/>
                      <path d="M33 27.4951H36.9999V33.4951H41V23.4951H27V27.4951H29V31.4951H33V27.4951Z" fill="#CE2E41"/>
                      <path d="M29 31.4951H25V37.4951H29V31.4951Z" fill="#CE2E41"/>
                      <path d="M45 33.4951H41V37.4951H45V33.4951Z" fill="#CE2E41"/>
                      <path d="M33.0001 37.4951H29V41.4951H25V45.4952H33.0001V41.4951H37V45.4952H43V41.4951H41V37.4951H37H33.0001Z" fill="#CE2E41"/>
                      <path d="M19 37.4951V31.4951H5V45.4951H19V41.4951H25V37.4951H19ZM15 41.4951H9.00003V35.4951H15V41.4951Z" fill="#CE2E41"/>
                    </svg>
                    СБП по номеру или QR код
                  </div>
                  <div class="ul_card">
                    <svg width="50" height="50" viewBox="0 0 50 50" fill="none" xmlns="http://www.w3.org/2000/svg">
                      <path d="M2.61342 25.0528C2.12968 25.2309 1.88034 25.7671 2.05655 26.2527L2.64533 27.8727L7.12831 23.3896L2.61342 25.0528Z" fill="#CE2E41"/>
                      <path d="M6.85547 39.4531L9.55544 46.878C9.63981 47.1124 9.81603 47.3037 10.041 47.4068C10.1666 47.4649 10.3016 47.4949 10.4366 47.4949C10.5473 47.4949 10.656 47.4762 10.761 47.4368L13.7404 46.3381L6.85547 39.4531Z" fill="#CE2E41"/>
                      <path d="M46.9454 33.1151L43.8554 24.6196L36.4399 32.0351L40.1148 30.6814C40.5967 30.4976 41.1404 30.7489 41.3186 31.2364C41.4986 31.722 41.2492 32.262 40.7636 32.4401L36.0949 34.1614C35.988 34.2007 35.8793 34.2195 35.7705 34.2195C35.3898 34.2195 35.0298 33.9851 34.8911 33.6063C34.8893 33.6007 34.8911 33.5951 34.8893 33.5895L27.0312 41.4475L46.3885 34.3151C46.8741 34.137 47.1234 33.6007 46.9454 33.1151Z" fill="#CE2E41"/>
                      <path d="M46.7244 17.7692L31.7245 2.76933C31.3589 2.40371 30.7645 2.40371 30.3989 2.76933L2.27422 30.894C1.90859 31.2596 1.90859 31.854 2.27422 32.2196L17.2741 47.2195C17.4559 47.4033 17.6959 47.4951 17.936 47.4951C18.176 47.4951 18.4159 47.4033 18.5997 47.2213L46.7244 19.0967C47.09 18.7292 47.09 18.1367 46.7244 17.7692ZM12.9748 28.4716L9.22479 32.2215C9.04101 32.4033 8.80107 32.4953 8.56105 32.4953C8.32102 32.4953 8.08108 32.4034 7.8973 32.2215C7.53168 31.8559 7.53168 31.2615 7.8973 30.8958L11.6473 27.1459C12.0129 26.7802 12.6073 26.7802 12.9729 27.1459C13.3385 27.5116 13.3404 28.104 12.9748 28.4716ZM29.1652 29.6621C28.5014 30.3259 27.5996 30.6447 26.5964 30.6447C24.9389 30.6447 23.0021 29.7766 21.3821 28.1547C20.1971 26.9696 19.3646 25.5522 19.0403 24.1647C18.6803 22.6179 18.9766 21.2717 19.8746 20.3717C20.7728 19.4717 22.119 19.1754 23.6677 19.5373C25.0552 19.8617 26.4727 20.6923 27.6576 21.8792C30.262 24.4816 30.9258 27.9015 29.1652 29.6621ZM41.0994 19.0967L37.3495 22.8467C37.1657 23.0285 36.9257 23.1204 36.6857 23.1204C36.4457 23.1204 36.2057 23.0286 36.022 22.8467C35.6564 22.481 35.6564 21.8866 36.022 21.521L39.772 17.771C40.1376 17.4054 40.732 17.4054 41.0976 17.771C41.4632 18.1367 41.4651 18.7292 41.0994 19.0967Z" fill="#CE2E41"/>
                    </svg>
                    Наличными по факту поставки (даем скидку 2%)
                  </div>
                </div>
                <div class="ul ul_ul_ul">
                  <div class="ul_info">
                    <svg width="40" height="40" viewBox="0 0 40 40" fill="none" xmlns="http://www.w3.org/2000/svg">
                      <rect width="40" height="40" rx="5" fill="#CE2E41"/>
                      <path d="M30.0757 14.1776C30.047 13.5462 30.047 12.9435 30.047 12.3408C30.047 11.8529 29.6739 11.4798 29.186 11.4798C25.5986 11.4798 22.8721 10.4466 20.6048 8.23677C20.2604 7.92108 19.7438 7.92108 19.3995 8.23677C17.1322 10.4466 14.4057 11.4798 10.8183 11.4798C10.3304 11.4798 9.9573 11.8529 9.9573 12.3408C9.9573 12.9435 9.9573 13.5462 9.9286 14.1776C9.8138 20.2045 9.64161 28.47 19.7151 31.9426L20.0021 32L20.2891 31.9426C30.334 28.47 30.1905 20.2332 30.0757 14.1776ZM19.3134 22.5291C19.1412 22.6726 18.9403 22.7587 18.7107 22.7587H18.682C18.4524 22.7587 18.2228 22.6439 18.0793 22.4717L15.4102 19.5157L16.7017 18.3677L18.7968 20.6924L23.4461 16.2726L24.6228 17.5354L19.3134 22.5291Z" fill="white"/>
                    </svg>

                    <div>
                    <span>Цены фиксируются</span>
                    <p>в договоре поставки и не подлежат изменению</p>
                  </div>
                </div>
                  <div class="ul_info">
                    <svg width="40" height="40" viewBox="0 0 40 40" fill="none" xmlns="http://www.w3.org/2000/svg">
                      <rect width="40" height="40" rx="5" fill="#CE2E41"/>
                      <g clip-path="url(#clip0_126_4248)">
                      <path d="M13.375 19.3438C9.88567 19.3438 7.04688 22.1825 7.04688 25.6719C7.04688 29.1612 9.88567 32 13.375 32C16.8643 32 19.7031 29.1612 19.7031 25.6719C19.7031 22.1825 16.8643 19.3438 13.375 19.3438ZM16.169 24.9034L12.8878 28.1847C12.7505 28.322 12.5706 28.3906 12.3906 28.3906C12.2107 28.3906 12.0307 28.322 11.8935 28.1847L10.4872 26.7784C10.2126 26.5039 10.2126 26.0586 10.4872 25.784C10.7618 25.5095 11.207 25.5095 11.4816 25.784L12.3906 26.6931L15.1747 23.909C15.4493 23.6345 15.8945 23.6345 16.1691 23.909C16.4436 24.1836 16.4436 24.6289 16.169 24.9034Z" fill="white"/>
                      <path d="M25.5625 14.0938C25.1742 14.0938 24.8594 13.7789 24.8594 13.3906V8H14.7812C13.6181 8 12.6719 8.94627 12.6719 10.1094V17.9698C12.9035 17.9488 13.138 17.9375 13.375 17.9375C15.7716 17.9375 17.917 19.0332 19.3368 20.75H26.9688C27.3571 20.75 27.6719 21.0648 27.6719 21.4531C27.6719 21.8414 27.3571 22.1562 26.9688 22.1562H20.2632C20.7027 23.0139 20.9861 23.964 21.0771 24.9688H26.9688C27.3571 24.9688 27.6719 25.2836 27.6719 25.6719C27.6719 26.0602 27.3571 26.375 26.9688 26.375H21.0771C20.8668 28.6971 19.6261 30.7262 17.8168 32H28.8438C30.0069 32 30.9531 31.0537 30.9531 29.8906V14.0938H25.5625ZM26.9688 17.9375H16.6562C16.2679 17.9375 15.9531 17.6227 15.9531 17.2344C15.9531 16.8461 16.2679 16.5312 16.6562 16.5312H26.9688C27.3571 16.5312 27.6719 16.8461 27.6719 17.2344C27.6719 17.6227 27.3571 17.9375 26.9688 17.9375Z" fill="white"/>
                      <path d="M26.2656 8.41162V12.6874H30.5411L26.2656 8.41162Z" fill="white"/>
                      </g>
                      <defs>
                      <clipPath id="clip0_126_4248">
                      <rect width="24" height="24" fill="white" transform="translate(7 8)"/>
                      </clipPath>
                      </defs>
                      </svg>

                    <div>
                    <span>Формируем все закрывающие документы</span>
                    <p>+ возврат НДС</p>
                  </div>
                </div>
                </div>
                

                <div class="ul-text">
                 <span>После первого обращения в компанию за Вами закрепится персональный менеджер, который будет курировать весь процесс работы:</span> 
                 <ul>
                  <li>
                    <svg width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                      <path d="M8 0C3.584 0 0 3.584 0 8C0 12.416 3.584 16 8 16C12.416 16 16 12.416 16 8C16 3.584 12.416 0 8 0ZM6.4 12L2.4 8L3.528 6.872L6.4 9.736L12.472 3.664L13.6 4.8L6.4 12Z" fill="#CE2E41"/>
                      <path d="M6.4 12L2.4 8L3.528 6.872L6.4 9.736L12.472 3.664L13.6 4.8L6.4 12Z" fill="white"/>
                    </svg>
                    заключение договора;
                  </li>
                  <li>
                    <svg width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                      <path d="M8 0C3.584 0 0 3.584 0 8C0 12.416 3.584 16 8 16C12.416 16 16 12.416 16 8C16 3.584 12.416 0 8 0ZM6.4 12L2.4 8L3.528 6.872L6.4 9.736L12.472 3.664L13.6 4.8L6.4 12Z" fill="#CE2E41"/>
                      <path d="M6.4 12L2.4 8L3.528 6.872L6.4 9.736L12.472 3.664L13.6 4.8L6.4 12Z" fill="white"/>
                    </svg>
                    согласование спецификаций;
                  </li>
                  <li>
                    <svg width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                      <path d="M8 0C3.584 0 0 3.584 0 8C0 12.416 3.584 16 8 16C12.416 16 16 12.416 16 8C16 3.584 12.416 0 8 0ZM6.4 12L2.4 8L3.528 6.872L6.4 9.736L12.472 3.664L13.6 4.8L6.4 12Z" fill="#CE2E41"/>
                      <path d="M6.4 12L2.4 8L3.528 6.872L6.4 9.736L12.472 3.664L13.6 4.8L6.4 12Z" fill="white"/>
                    </svg>
                    предоставление сопутствующих услуг;
                  </li>
                  <li>
                    <svg width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                      <path d="M8 0C3.584 0 0 3.584 0 8C0 12.416 3.584 16 8 16C12.416 16 16 12.416 16 8C16 3.584 12.416 0 8 0ZM6.4 12L2.4 8L3.528 6.872L6.4 9.736L12.472 3.664L13.6 4.8L6.4 12Z" fill="#CE2E41"/>
                      <path d="M6.4 12L2.4 8L3.528 6.872L6.4 9.736L12.472 3.664L13.6 4.8L6.4 12Z" fill="white"/>
                    </svg>
                    согласование специальных коммерческих условий;
                  </li>
                  <li>
                    <svg width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                      <path d="M8 0C3.584 0 0 3.584 0 8C0 12.416 3.584 16 8 16C12.416 16 16 12.416 16 8C16 3.584 12.416 0 8 0ZM6.4 12L2.4 8L3.528 6.872L6.4 9.736L12.472 3.664L13.6 4.8L6.4 12Z" fill="#CE2E41"/>
                      <path d="M6.4 12L2.4 8L3.528 6.872L6.4 9.736L12.472 3.664L13.6 4.8L6.4 12Z" fill="white"/>
                    </svg>
                    профессиональные консультации по товарам и услугам;
                  </li>
                  <li>
                    <svg width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                      <path d="M8 0C3.584 0 0 3.584 0 8C0 12.416 3.584 16 8 16C12.416 16 16 12.416 16 8C16 3.584 12.416 0 8 0ZM6.4 12L2.4 8L3.528 6.872L6.4 9.736L12.472 3.664L13.6 4.8L6.4 12Z" fill="#CE2E41"/>
                      <path d="M6.4 12L2.4 8L3.528 6.872L6.4 9.736L12.472 3.664L13.6 4.8L6.4 12Z" fill="white"/>
                    </svg>
                    организацию встреч, в том числе с поставщиками;
                  </li>
                  <li>
                    <svg width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                      <path d="M8 0C3.584 0 0 3.584 0 8C0 12.416 3.584 16 8 16C12.416 16 16 12.416 16 8C16 3.584 12.416 0 8 0ZM6.4 12L2.4 8L3.528 6.872L6.4 9.736L12.472 3.664L13.6 4.8L6.4 12Z" fill="#CE2E41"/>
                      <path d="M6.4 12L2.4 8L3.528 6.872L6.4 9.736L12.472 3.664L13.6 4.8L6.4 12Z" fill="white"/>
                    </svg>
                    доставку и отгрузку товаров;
                  </li>
                  <li>
                    <svg width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                      <path d="M8 0C3.584 0 0 3.584 0 8C0 12.416 3.584 16 8 16C12.416 16 16 12.416 16 8C16 3.584 12.416 0 8 0ZM6.4 12L2.4 8L3.528 6.872L6.4 9.736L12.472 3.664L13.6 4.8L6.4 12Z" fill="#CE2E41"/>
                      <path d="M6.4 12L2.4 8L3.528 6.872L6.4 9.736L12.472 3.664L13.6 4.8L6.4 12Z" fill="white"/>
                    </svg>
                    документооборот.
                  </li>
                 </ul>
                 <p>
                  Работаем по счет-договору
                 </p>
                 <span>Цены</span>
                 <p>
                  Для юридических лиц действуют специальные цены. Скидки зависят от объемов партии товаров. С каждым юридическим лицом стоимость товаров согласовывается индивидуально.
                 </p>
                 <span>Оплата</span>
                 <p>
                  Оплата заказа осуществляется переводом на расчетный счет. Перед оплатой дождитесь подтверждения заказа Вашим менеджером.
                 </p>
                 <span>Отгрузка</span>
                 <p>
                  Отгрузка товаров возможна при выполнении обоих условий:
                 </p>
                 <ul>
                  <li>
                    <svg width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                      <rect width="16" height="16" rx="8" fill="#CE2E41"/>
                      <path d="M8.8348 3.9V12H6.9988V5.64H6.5428V3.9H8.8348Z" fill="white"/>
                    </svg>
                    При наличии подписанного Договора;
                  </li>
                  <li>
                    <svg width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                      <rect width="16" height="16" rx="8" fill="#CE2E41"/>
                      <path d="M5.23892 12V10.572L7.96292 7.872C8.33092 7.504 8.59092 7.2 8.74292 6.96C8.89492 6.712 8.97092 6.472 8.97092 6.24C8.97092 5.968 8.89092 5.76 8.73092 5.616C8.57092 5.464 8.34292 5.388 8.04692 5.388C7.34292 5.388 6.99092 5.744 6.99092 6.456H5.15492C5.15492 5.592 5.41092 4.92 5.92292 4.44C6.44292 3.96 7.16692 3.72 8.09492 3.72C8.95892 3.72 9.63492 3.932 10.1229 4.356C10.6109 4.78 10.8549 5.364 10.8549 6.108C10.8549 6.572 10.7429 7.004 10.5189 7.404C10.3029 7.804 9.93092 8.252 9.40292 8.748L7.65092 10.416L10.8789 10.392V12H5.23892Z" fill="white"/>
                    </svg>
                    100% предоплаты заказа.
                  </li>
                 </ul>
                 <p>
                  Грузополучатель должен иметь при себе оригинал доверенности на приемку товара. Оригинал доверенности должен быть оформлен в соответствии с действующим законодательством.
                 </p>
                 <span>Отправим документы любым способом:</span>
                 <ul>
                  <li>
                    <svg width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                      <path d="M8 0C3.584 0 0 3.584 0 8C0 12.416 3.584 16 8 16C12.416 16 16 12.416 16 8C16 3.584 12.416 0 8 0ZM6.4 12L2.4 8L3.528 6.872L6.4 9.736L12.472 3.664L13.6 4.8L6.4 12Z" fill="#CE2E41"/>
                      <path d="M6.4 12L2.4 8L3.528 6.872L6.4 9.736L12.472 3.664L13.6 4.8L6.4 12Z" fill="white"/>
                    </svg>
                    через ЭДО: Контур Диадок, СБИС, либо подключим роуминг;
                  </li>
                  <li>
                    <svg width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                      <path d="M8 0C3.584 0 0 3.584 0 8C0 12.416 3.584 16 8 16C12.416 16 16 12.416 16 8C16 3.584 12.416 0 8 0ZM6.4 12L2.4 8L3.528 6.872L6.4 9.736L12.472 3.664L13.6 4.8L6.4 12Z" fill="#CE2E41"/>
                      <path d="M6.4 12L2.4 8L3.528 6.872L6.4 9.736L12.472 3.664L13.6 4.8L6.4 12Z" fill="white"/>
                      </svg>
                      на бумажных носителях;
                  </li>
                  <li>
                    <svg width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                      <path d="M8 0C3.584 0 0 3.584 0 8C0 12.416 3.584 16 8 16C12.416 16 16 12.416 16 8C16 3.584 12.416 0 8 0ZM6.4 12L2.4 8L3.528 6.872L6.4 9.736L12.472 3.664L13.6 4.8L6.4 12Z" fill="#CE2E41"/>
                      <path d="M6.4 12L2.4 8L3.528 6.872L6.4 9.736L12.472 3.664L13.6 4.8L6.4 12Z" fill="white"/>
                    </svg>
                    по электронной почте.
                  </li>
                 </ul>
                </div>
              </div>
            </p>
        </TabPanel>
    </TabPanels>
      </Tabs>
    </section>
    <!-- <IndexInfoProducts></IndexInfoProducts> -->
 

    <!-- <IndexTrends></IndexTrends> -->
    <!-- <IndexGiveLead></IndexGiveLead> -->
    <!-- <IndexLoremIpsum></IndexLoremIpsum> -->
  </div>  
</template>
<script lang="ts" setup>
import Tabs from 'primevue/tabs';
import TabList from 'primevue/tablist';
import Tab from 'primevue/tab';
import TabPanels from 'primevue/tabpanels';
import TabPanel from 'primevue/tabpanel';
import Accordion from 'primevue/accordion';
import AccordionPanel from 'primevue/accordionpanel';
import AccordionHeader from 'primevue/accordionheader';
import AccordionContent from 'primevue/accordioncontent';
definePageMeta({
  layout: 'page',
  title: 'Оплата',
  description: 'Оплата',
  breadcrumbs: [
  {
    title: 'Оплата',
    url: '/pay'
  }
  ],
  breadcrumbsTitle: 'Оплата',
  breadcrumbsDescription: 'Оплата'
})
</script>
<style scoped>



.ul-text{
  width: 100%;
  border-radius: 5px;
  background-color: #FFFFFF;
  padding: 40px 40px 40px 40px;

  && span{
    font-weight: 700;
    margin: 0px 0px 10px 0px;
    display: flex;
  }

  && p{
    margin: 0px 0px 10px 0px;
  }
}

.pay_ul_layer{
  width: 100%;
  display: flex;
  justify-content: space-between;
  flex-wrap: wrap;
}

.ul_info{
  display: flex;
  align-items: flex-start;
  max-width: 404px;
  width: 100%;
  border-radius: 5px;
  padding: 20px 20px 20px 40px;
  background-color: #FFFFFF;
  position: relative;
  max-height: max-content;

  && svg{
    position: absolute;
    left: -25px;
  }
  
  && span{
    font-size: 20px;
    font-weight: 700;
  }
}

.ul{
  display: flex;
  width: 50%;
  flex-wrap: wrap;
  gap: 4%;
  justify-content: flex-end;
}

.ul_card{
  display: flex;
  align-items: center;
  border-radius: 5px;
  background-color: #FFFFFF;
  padding: 20px 20px 20px 20px;
  margin: 0px 0px 4% 0px;
  width: 48%;

  && svg{
    margin: 0px 15px 0px 0px;
    min-width: 50px;
    min-height: 50px;
  }
}


.ul_ul_ul{
  gap: 0;
  width: 40%;
}
.pay_section{
  margin: auto auto 125px auto;
}

.phusic_info{
  width: 100%;
  padding: 40px 40px 40px 40px;
  background-color: #FFFFFF;
  border-radius: 5px;
  display: flex;

  && div{
    display: flex;
    align-items: center
  }

  && span{
    font-size: 25px;
    font-weight: 700;
    margin: 0px 0px 10px 0px;
  }

  && a{
    margin: 0px 5px 0px 0px;
  }
}

.phusic_info div:first-child{
  flex-direction: column;
  align-items: flex-start;
  width: 50%;
  
}
.phusic_info div:last-child{
  flex-direction: row;
  width: 50%;
}
.physic_number{
  display: flex;
  align-items: center;
  flex-direction: row!IMPORTANT;
  margin: 0px 20px 0px 0px;
  font-size: 20px;
  max-width: max-content;
  line-height: 0.9;
  
  && svg{
    margin: 0px 10px 0px 0px;
  }
}
.pay_physics_layer{
  display: flex;
  justify-content: space-between;
  gap: 2%;
  flex-wrap: wrap;
}

.physic{
  display: flex;
  gap: 2%;
  flex-wrap: wrap;
  width: 49%;
  justify-content: flex-end;

  && .fuck{
    background-color: #FFFFFF;
    height: max-content;
    padding: 20px 20px 20px 29px;
    gap: 10px;

    span{
      font-size: 20px;
      margin: 0px 0px 0px 0px;
    }

    p{
      font-size: 15px;
    }
    
    svg{
      top: 15px;
    }
  }
}

.pay_physics_layer .physic:first-child{
  justify-content: flex-start
}
.physic_card{
  background-color: #FFFFFF;
  border-radius: 5px;
  padding: 20px 20px 20px 20px;
  width: 49%;
  margin: 0% 0% 2% 0%;
  display: flex;
  align-items: center;
  gap: 10px;

  && svg{
    min-width: 50px;
    min-height: 50px;
  }
}


.contact_section{
  background-color: #272727;
  border-radius: 5px;
  color: #FFFFFF;
  margin: auto auto 125px auto;

  && h2{
    font-size: 35px;
    font-weight: 700;
  }

  && p{
    font-size: 20px;
  }

  && div{
    display: flex;
    flex-direction: column;
    gap: 10px;
    width: 50%;
  }

  && form{
    padding: 40px 40px 40px 40px;
    display: flex;
    align-items: center;
    justify-content: space-between;
    
    textarea{
      padding: 20px 20px 20px 20px;
      border-radius: 5px;
      color: #272727;
    }
    
    input{
      padding: 15px 20px 15px 20px;
      border-radius: 5px;
      color: #272727;

    }
    
    label{
      display: flex;
      align-items: center;
      justify-content: center;
      font-size: 12px;
      color: #959595;

      input{
        margin: 0px 10px 0px 0px;
      }
    }
  }
}

.faq_section{
  padding: 0px 0px 125px 0px;
}
.p-accordioncontent-content{
  border: none;
  padding: 0;
  outline: none;
  border-style: none;
  border-color: #FFFFFF!IMPORTANT;
}
.p-tabpanels{
  border: none!IMPORTANT;
  outline: none!IMPORTANT;
  background-color: inherit!IMPORTANT;
  background: inherit!IMPORTANT;
  border-radius: 5px;
  overflow: hidden;
  border-style: none;
  border-color: #FFFFFF!IMPORTANT;
}
.p-tabpanel{
  border: none;
  border-style: none;
  border-color: #FFFFFF!IMPORTANT;
}
.p-accordionheader{
  padding: 20px;
  border: none;
  border-style: none;
  border-color: #FFFFFF!IMPORTANT;
}
.p-accordioncontent-content{
  border: none;
  padding: 20px;
  border-style: none;
  border-color: #FFFFFF!IMPORTANT;

  && p{
    border: none!IMPORTANT;
    padding: 20px;
    border-style: none;
    border-color: #FFFFFF;
  }
}
.p-accordionpanel:not(.p-disabled).p-accordionpanel-active > .p-accordionheader{
  color: #FFFFFF;
  background-color: #272727;
  border: none;
}
.garantiya_contacts{
  background-color: #272727;
  padding: 40px 40px 40px 40px;
  border-radius: 5px;
  position: relative;
  margin: 0 auto 150px auto;
  max-width: 1320px;
  overflow: hidden;
  width: calc(100% - 29px);
  color: #FFFFFF;
  
  && span{
    display: flex;
    align-items: center;

    svg{
      margin: 0px 10px 0px 0px;
    }
  }

  && p{
    margin: 20px 0px 20px 0px;
  }

  && h2{
    font-size: 40px;
    color: #FFFFFF;
    font-weight: 700;
  }

  && div{
    background-color: #CE2E41;
    padding: 20px 20px 20px 20px;
    color: #FFFFFF;
    border-radius: 5px;
    font-size: 20px;
    display: flex;
    flex-direction: column;
    gap: 10px;
    margin: 20px 0px 20px 0px;
    width: max-content;
    
    span{
      display: flex;
      align-items: center;
      margin: 0px 10px 0px 10px;
      
      svg{
        margin: 0px 10px 0px 0px;
      }
    }

    p{
      display: flex;
      align-items: center;
      margin: 0px 0px 0px 0px;
    }
  }

}

.garantiya_contacts_fon{
  position: absolute;
  right: 0%;
  bottom: 0;
  top: 25%;
}
.garantiya_info{
  padding: 40px 40px 40px 40px;
  background-color: #FFFFFF;
  border-radius: 5px;
  display: flex;
  flex-direction: column;
  gap: 0px;
  margin: 0px auto 125px auto;

  && span{
    font-size: 25px;
    font-weight: 700;
    display: flex;
    width: 100%;
  }
  
  && p{
    display: flex;
    width: 100%;
    margin: 0px 0px 20px 0px;
  }

  && div{
    display: flex;
    align-items: center;
    margin: 0px 0px 20px 0px;
    
    svg{
      margin: 0px 10px 0px 0px;
    }
  }
  && ul{
    margin: 0px 0px 20px 0px;
    display: flex;
    flex-direction: column;
    gap: 10px;
  }
}

.garantiya_info.garantiya_info span{
  margin: 0px 0px 20px 0px;
}


.p-tablist-tab-list{
  margin: 0px 0px 0px 0px!IMPORTANT;
}

.fuck_layer{
 padding: 0px 0px 0px 25px;
 margin: 0px 0px 125px 0px!IMPORTANT;
 margin: 0 auto 50px auto!IMPORTANT;
 display: flex;
 gap: 50px;
 max-width: 1320px;
}
.fuck{
  width: 50%;
  padding: 35px 20px 35px 45px;
  display: flex;
  flex-direction: column;
  position: relative;
  gap: 10px;

  && span{
    font-size: 25px;
    font-weight: 700;
  }

  && p{
    font-size: 17px;
  }
}
.fuck_svg{
  position: absolute;
  left: -25px;
  top: 25px;
}
.fuck_phone{
  display: flex;
  padding: 0px 0px 0px 0px;
  gap: 10px;

  && span{
    font-size: 20px;
    font-weight: 400;
    display: flex;
    align-items: center;
    gap:10px;
    margin: 0px 10px 0px 0px;
  }
}

















.other_sales{
  margin: 125px auto auto auto;
  && h2{
    font-size: 40px;
    font-weight: 700;
  }
}
.sale_section{
  padding: 10px 0px 125px 0px;
}
.sale_info{
  && div{
    padding: 20px 40px 20px 40px;
    width: 100%;
    background-color: #FFFFFF;
    border-radius: 5px;

    span{
      margin: 0px 20px 0px 0px;
    }
  }

  && SaleInfo{
    color: #777777;
  }

  && span{
    margin: 0px 20px 0px 0px;
  }

  && a{
    margin: 0px 10px 0px 0px;
  }
}

.sale_layer{
  display: flex;
  gap: 20px;
  
  && img{
    width: 100%;
    height: 100%;
    max-width: 312px;
    max-height: 312px;
    min-width: 312px;
    min-height: 312px;
    border-radius: 5px;
  } 

}
.tab_content{
  display: flex;
  gap: 2%;
  width: 100%;
  flex-wrap: wrap;
  background-color: #FFFFFF;
  padding: 40px 40px 40px 40px;
  border-radius: 5px;
  width: 100%;

  && h2{
    font-size: 25px;
    font-weight: 700;
    margin: 0px 0px 0px 0px;
  }

  && p{
    margin: 20px 0px 0px 0px;
  }
}
.p-tablist-tab-list{
  flex-direction: column!IMPORTANT;
}
.sale_info{
  display: flex;
  flex-direction: column;
  gap: 15px;
}
.sale_item{
  width: 100%;
  padding: 0px 0px 0px 0px;
  background-color: #ffffff;
  border-radius: 5px;
  margin: 0px 0px 20px 0px;
  display: flex;
  align-items: center;
  gap: 40px;
  overflow: hidden;

  && span{
    font-size: 20px;
    font-weight: 700;
  }

  && img{
    width: 100%;
    height: 100%;
    object-fit: contain;
    max-height: 195px;
    max-width: 195px;
  }

  && SaleInfo{
    color: #777777;
  }

  && a{
    color: #CE2E41;
  }
}
.working_time{
  background-color: #ffffff;
  padding: 40px 40px 40px 40px;
  border-radius: 5px;
  margin: 125px auto 20px auto;
  display: flex;
  align-items: flex-start;

  && svg{
    margin: 0px 15px 0px 0px;
    min-width: 35px;
    min-height: 35px;
  }
  && h2{
    font-size: 25px;
    font-weight: 700;
    margin: 0px 0px 20px 0px;
  }
  && h3{
    font-size: 25px;
    font-weight: 700;
    margin: 0px 0px 10px 0px;
    
  }
}
.company_button{
  width: 100%;
  display: flex;
  align-items: center;
  justify-content: space-between;
  margin: 40px 0px 0px 0px;
}
.company_info{
  padding: 40px 40px 40px 40px;
  background-color: #ffffff;
  border-radius: 5px;
  margin: 0px auto 125px auto;
  && li{
    display: flex;
    width: 100%;
  }
  && div{
    display: flex;
    width: 100%;
  }
  && span{
    width: 49%;
    display: flex;
  }
  && h2{
    font-size: 25px;
    font-weight: 700;
    margin: 0px 0px 20px 0px;
  }
  && a button{
    background-color: #CE2E411A;
    width: 100%;
    max-width: 215px;
    border-radius: 5px;
    display: flex;
    justify-content: center;
    align-items: center;
    height: 50px;
    font-weight: 700;
    font-size: 15px;
    padding: 25px 25px 25px 25px;
  }
}

.tab_list_custom_page{
  display: flex;
  flex-direction: column;
  
}
.p-tablist-tab-list{
  flex-direction: column!IMPORTANT;
}
.tab_list_custom_page .p-tablist-tab-list{
  flex-direction: column!IMPORTANT;
}
.company_info{
  && button{
    color: #CE2E41;
    min-width: max-content;
    width: max-content;

    span{
      width: max-content;
      min-width: max-content;
      margin: 0px 0px 0px 0px;
    }
  }
}

.tabs_layer{
  padding: 20px 0px 125px 0px;
  display: flex;
  /* justify-content: space-between;
  flex-direction: row; */
}
.tab_content{
  display: flex;
  justify-content: space-between;
  align-items: center;
}

.tab_navigate{
  width: 50%;
}
.tab_adres{
  width: 40%;
  && h2{
    font-size: 40px;
    font-weight: 700;
  }

  && span{
    display: flex;
    align-items: center;
    margin: 20px 0px 50px 0px;
  }

  && h3{
    font-size: 25px;
    font-weight: 700;
    margin: 20px 0px 20px 0px;
  }
}

.p-tablist-content{
  overflow: hidden!IMPORTANT;
  overflow-y: auto!IMPORTANT;
  overflow-x: auto!IMPORTANT;
}
@media (max-width: 1200px){
  .index-tab{
    min-width: 50%!IMPORTANT
  }
}


@media (max-width: 979px){

  .ul_card.ul_card svg{
    min-width: 25px;
    min-height: 25px;
  }
  .ul_info.ul_info span{
    font-size: 18px;
  }

  .physic_card.physic_card svg{
    min-width: 27px;
    min-height: 27px;
  }
  .fuck{
    width: 90%;
  }
  .phusic_info.phusic_info span{
    font-size: 20px;
  }
  .phusic_info{
    padding: 20px 20px 20px 20px;
  }
  
  .faq_section{
    padding: 0px 0px 50px 0px;
  }
  .contact_section{
    margin: auto auto 50px auto;
  }
  .contact_section.contact_section form{
    align-items: flex-start;
  }
  .contact_section.contact_section h2{
    font-size: 25px;
  }
  .contact_section.contact_section p{
    font-size: 15px;
  }
  .garantiya_contacts{
    padding: 20px 20px 20px 20px;
    margin: 0 auto 50px auto;
  }
  .garantiya_contacts.garantiya_contacts h2{
    font-size: 25px;
  }
  .garantiya_contacts.garantiya_contacts div{
    font-size: 15px;
  } 
  .sale_info{
    && div{
      padding: 20px 20px 20px 20px;
    }
  }
  .sale_title{
    flex-direction: column;
    gap: 10px;
    display: flex;
  }
  .sale_item{
    gap: 20px;
    font-size: 13px;

    && img{
      width: 100vw;
      height: auto;
      max-width: 23vw;
      object-fit: cover;
    }

    && li{
      flex-direction: column;
      display: flex;
      align-items: flex-start;
      justify-content: flex-start;
      text-align: left;
    }
    && ul{
      display: flex;
      gap: 10px;
      flex-direction: column;
    }
    && div{
      padding: 10px 10px 10px 0px;
    }
  }
  .sale_item.sale_item span{
    font-size: 14px;
  }
    .tabs_layer{
      padding: 50px 0px 50px 0px!IMPORTANT;
      padding: 0px 0px 0px 0px!IMPORTANT;
    }

    .tab_adres{
      width: 50%;
      && h2{
        font-size: 25px;
      }
      
    }
    .p-tab{
      font-size: 14px;
    }
    .tab_adres.tab_adres span{
      margin: 10px 0px 10px 0px;
    }
    .tab_adres.tab_adres h3{
      font-size: 20px;
    }
    .p-tabpanels{
      && p{
        font-size: 14px;
      }
    }
    .working_time{
      margin: 50px auto 0px auto;
      padding: 20px 20px 20px 20px;

      && h3{
        font-size: 20px;
      }

      && svg{
        min-width: 25px;
        min-height: 25px;
      }
    }
    .company_info{
      padding: 20px 20px 20px 20px;
      margin: 20px auto 50px auto;
    }
    .company_info.company_info h2{
      font-size: 20px;
    }
    .company_info.company_info span{
      font-size: 14px;
    }
    .other_sales.other_sales h2{
      font-size: 25px;
    }
    .other_sales{
      margin: 50px auto auto auto;
    }
    .sale_section{
      margin: 10px auto 50px auto;
      padding: 0px 0px 0px 0px;
    }

    .fuck_layer{
      padding: 0px 20px 0px 45px;
    }

    .fuck{
      && span{
        font-size: 20px;
      }
    }
    .garantiya_info{
      margin: auto auto 50px auto;
    }
    .content.tabs_layer{
      margin: auto auto 50px auto;
    }


    .physic.physic .fuck span{
      font-size: 18px;
    }
    .ul-text{
      padding: 20px 20px 20px 20px;
    }
}


@media (max-width: 679px){
  .pay_physics_layer{
    flex-direction: column;
  }
  .pay_physics_layer .physic{
    width: 100%;
    flex-direction: column;
  }
  .physic_card{
    width: 100%;
    padding: 10px 10px 10px 10px;
    padding: 20px 20px 20px 20px;
  }
  .physic_card.physic_card svg{
    min-width: 25px;
    min-height: 25px;
    height: 25px;
    width: 25px;
  }
  .faq_section{
    padding: 0px 0px 40px 0px;
  }
  .contact_section{
    margin: auto auto 40px auto;
  }
  .contact_section.contact_section form{
    flex-direction: column;
    gap: 20px;
    padding: 20px 20px 20px 20px;
    div{
      width: 100%;
    }
  }
  .garantiya_contacts.garantiya_contacts div{
    width: 100%;
    align-items: flex-start;
    justify-content: flex-start;
    p{
      display: flex;
      flex-direction: column;
      align-items: flex-start;
      justify-content: flex-start;

      svg{
        margin: 0px 10px 0px 0px;
      }
    }
    span{
      width: 100%;
      padding: 0px 0px 0px 0px;
      margin: 10px 0px 0px 0px;
    }
  }
  .garantiya_contacts.garantiya_contacts h2{
    font-size: 20px;
  }
  .sale_section{
    margin: 0 auto;
  }
  .sale_layer{
    flex-direction: column;

    && img{
      width: 100%;
      max-width: 100%;
    }
  }
  .p-tablist-tab-list{
      margin: 0px 0px 10px 0px!IMPORTANT;
    }

  .sale_item{
    flex-direction: column;
    width: 100%;

    && img{
      width: 100%;
      max-width: 100%;
      max-height: auto;
    }

    && div{
      padding: 0px 10px 20px 20px;
    }
  }
.fuck_layer{
 padding: 0px 20px 0px 35px;
 margin: 0px 0px 125px 0px!IMPORTANT;
 margin: 0;
 display: flex;
 gap: 20px;
 flex-direction: column;
}
.fuck{
  width: 100%;
  padding: 20px 20px 20px 40px;
  display: flex;
  flex-direction: column;
  position: relative;
  gap: 10px;
  margin: 0px 0px 2% 0px;

  && span{
    font-size: 20px;
    font-weight: 700;
  }

  && p{
    font-size: 17px;
  }
}
.fuck_svg{
  position: absolute;
  left: -25px;
  top: 20px;
}
.fuck_phone{
  display: flex;
  padding: 0px 0px 0px 0px;
  gap: 10px;

  && span{
    font-size: 20px;
    font-weight: 400;
    display: flex;
    align-items: center;
    gap:10px;
    margin: 0px 10px 0px 0px;
  }
}
  .tab_content{
    gap: 4%;
    /* width: 100%;
    flex-direction: column; */
  }
  .tab_adres{
    width: 100%;
  }
  .tab_navigate{
    width: 100%;
  }
  .fuck_svg{
    width: 35px;
    height: 35px;
    left: -17.5px;
    top: 15px;
  }
  .fuck.fuck p{
    font-size: 14px;
  }
  .company_button{
    flex-direction: column;
    gap:20px;
    justify-content: flex-start;
    align-items: flex-start;
  }
  .fuck_layer{
    margin: 0px 0px 40px 0px!IMPORTANT;
  }
  .pay_physics_layer .physic:nth-last-child(2){
    padding: 0px 0px 0px 20px!IMPORTANT;
  }
  .phusic_info{
    flex-direction: column;
    gap: 10px;
  }
  .phusic_info div{
    width: 100%;
    max-width: 100%;
  }
  .phusic_info div:first-child{
    width: 100%;
  }
  .phusic_info div:last-child{
    width: 100%;
  }
  .p-tablist-tab-list{
    margin: 0px 0px 0px 0px!IMPORTANT;
  }
  .pay_ul_layer{
    flex-direction: column;
  }
  .ul{
    width: 100%;
    flex-direction: column;
  }
  .ul_card{
    width: 100%;
  }
  .ul_card.ul_card svg{
    width: 25px;
    height: 25px;
  }
  .ul_ul_ul{
    padding: 0px 0px 0px 25px;
    margin: 0px 0px 4% 0px;
  }
  .ul_info{
    padding: 20px 20px 20px 29px;
  }
}
</style>